{"pagination":{"current_page":1,"per_page":1024,"total_items":129,"total_pages":1,"next_page":null,"prev_page":null},"data":[{"netuid":0,"subnet_name":"Root","github_repo":null,"subnet_contact":null,"subnet_url":null,"logo_url":null,"discord":null,"description":null,"additional":null,"summary":null,"tags":null,"twitter":null},{"netuid":1,"subnet_name":"Apex","github_repo":"https://github.com/macrocosm-os/apex","subnet_contact":"support@macrocosmos.ai","subnet_url":"https://apex.macrocosmos.ai","logo_url":"https://www.macrocosmos.ai/images/mc_logo_black.png","discord":"macrocrux","description":"Open competitions for algorithmic and agentic optimization","additional":null,"summary":"Macrocosmos Subnet 1: Apex is a platform that facilitates open competitions for algorithmic and agentic optimization across diverse computational problem domains. Participants, referred to as miners, submit Python-based algorithms to compete in structured competitions consisting of multiple evaluation rounds. Validators assess these submissions against benchmarks, distributing blockchain-based rewards to top-performing solutions. Current competitions include tasks like matrix compression and strategic gameplay, incentivizing innovation and optimization through a trustless, transparent mechanism.","tags":["algorithm-competition","optimization","ai-agent"],"twitter":"@macrocosmosai"},{"netuid":2,"subnet_name":"DSperse","github_repo":"https://github.com/inference-labs-inc/subnet-2","subnet_contact":"","subnet_url":"https://subnet2.inferencelabs.com","logo_url":"https://dsperse.inferencelabs.com/logo-512.png","discord":"","description":"Verifiable and distributed inference on Bittensor","additional":null,"summary":"Subnet 2, developed by Inference Labs, is a decentralized marketplace for AI inference and compute verification within the Bittensor network. It leverages zero-knowledge cryptography to provide cryptographically verifiable and confidential AI outputs, enabling trustless verification of model inferences without revealing underlying data. Subnet 2 connects users to a variety of specialized AI services and digital commodities, such as data processing, computational tasks, and advanced model optimization, while incentivizing miners and validators to contribute high-quality, efficient proofs. The platform is proving-system agnostic, currently supporting frameworks like ezkl and circom, and aims to accelerate and democratize AI model confidentiality and inference verification across decentralized ecosystems.","tags":["ai","compute","verification","zero-knowledge"],"twitter":"@inference_labs"},{"netuid":3,"subnet_name":"τemplar","github_repo":"https://github.com/tplr-ai/templar","subnet_contact":"info@tplr.ai","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"τemplar is a decentralized framework designed to enable large-scale collaborative AI model training across heterogeneous compute resources on the internet. By connecting miners (who train models on assigned data subsets) and validators (who evaluate and score these contributions), τemplar leverages a blockchain-based incentive mechanism to reward honest and high-quality participation. The system ensures fair, scalable, and efficient distributed training by supporting diverse hardware, compressing gradients for reduced communication overhead, and using deterministic data assignments. Validators assess the effectiveness of miners' updates and update weights and rewards on-chain, promoting continuous model improvement and discouraging malicious behavior.","tags":["ai-training","compute","decentralized","blockchain"],"twitter":null},{"netuid":4,"subnet_name":"Targon","github_repo":"https://github.com/manifold-inc/targon","subnet_contact":"devs@manifold.inc","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"Targon is a decentralized AI infrastructure platform focused on providing end-to-end security for AI workloads using confidential compute (CC) and protected PCIe (PPCIE) technologies. By leveraging hardware-enforced memory encryption, secure boot, GPU trusted execution environments, and remote attestation, Targon ensures verifiable, trustworthy, and isolated execution from hardware to application layers. The platform currently integrates with NVIDIA's confidential compute and PPCIE, with plans to support additional vendors like AMD. Targon aims to offer a secure, developer-friendly environment for AI model inference and, in the future, training and data processing, supporting both validators and miners in its ecosystem.","tags":["ai-infrastructure","confidential-compute","security","decentralized-cloud"],"twitter":null},{"netuid":5,"subnet_name":"Hone","github_repo":"https://github.com/manifold-inc/hone","subnet_contact":"devs@manifold.inc","subnet_url":"https://www.hone.training/","logo_url":"https://www.hone.training/logo.svg","discord":"","description":"Hone training","additional":null,"summary":"Hone is an open, decentralized AI pretraining project focused on advancing artificial general intelligence (AGI) by leveraging hierarchical learning and reasoning. Built as a Bittensor subnet, Hone enables a global community of researchers and enthusiasts to collaboratively develop AI systems that can solve complex reasoning tasks, specifically targeting the challenging ARC-AGI-2 benchmark. The platform uses a validator-miner architecture: miners submit AI solvers via Git repositories, which are securely evaluated in GPU sandboxes by validators. Rewards are distributed based on performance, with transparency and open-source principles ensuring no single entity controls the resulting models. Hone aims to surpass current AI limitations by fostering collective innovation and safe, broadly beneficial AGI development.","tags":["ai-training","decentralized","compute","bittensor"],"twitter":"@manifoldlabs"},{"netuid":6,"subnet_name":"Numinous","github_repo":"https://github.com/numinouslabs/numinous","subnet_contact":"marc@infinitemech.io","subnet_url":"https://numinouslabs.io/","logo_url":"https://numinouslabs.io/numinous-logo.svg","discord":"amedeo_ma","description":"Numinous is a forecasting protocol whose goal is to aggregate agents into superhuman LLM forecasters.","additional":null,"summary":"Numinous is a forecasting protocol designed to aggregate and evaluate autonomous forecasting agents, aiming to achieve superhuman prediction capabilities through large language models (LLMs). Operating as a subnet, Numinous allows miners to submit agent code, which is executed and scored in isolated sandboxes by validators. The protocol emphasizes transparency, composability, and discoverability, enabling agents to learn from each other and serve as building blocks for advanced meta-models and prediction systems. Agents are scored based on their forecasting accuracy using a winner-takes-all Brier score mechanism, and strict execution and resource constraints ensure fairness and reproducibility. The system is open for both agent developers (miners) and validators, with comprehensive documentation and guides available.","tags":["prediction","ai-agent","forecasting"],"twitter":"@numinous_ai"},{"netuid":7,"subnet_name":"Unknown","github_repo":"","subnet_contact":"","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"subvortex is an incentivized and decentralized network of subtensor nodes designed to enhance the Bittensor ecosystem. It aims to improve decentralization, stability, and resource allocation by providing an alternative to the finney network, making it easier for miners and validators to participate with low hardware requirements and streamlined setup. The project features a robust incentive mechanism that rewards miners based on availability, latency, reliability, and global distribution of their nodes. With a focus on accessibility, simplicity, and continuous improvement, subvortex supports a healthy, distributed machine learning marketplace within Bittensor.","tags":["decentralization","infrastructure","ai-marketplace"],"twitter":null},{"netuid":8,"subnet_name":"Vanta","github_repo":"https://github.com/taoshidev/vanta-network","subnet_contact":"","subnet_url":"https://www.taoshi.io/","logo_url":"https://website-git-ken-vanta-taoshi.vercel.app/black-white.png","discord":"tl_arrash","description":"The first decentralized & trustless liquidity and execution engine for prop firms and traders.","additional":"Vanta Network is the first decentralized, trustless liquidity and execution engine for prop firms and traders. It live-trades top-performing miners who deposit alpha for funding, rewards them based on verifiable performance, and uses profits to buy back alpha, creating a transparent, risk-adjusted, and incentive-aligned trading ecosystem.","summary":"Taoshi is a decentralized trading network leveraging AI and blockchain to democratize access to advanced trading strategies. Built on the Bittensor blockchain, its Vanta Network enables traders and machine learning models to compete by submitting trading signals across forex and crypto markets. The platform uses risk-adjusted performance metrics to grade participants, with top traders earning rewards from a substantial annualized pool. Taoshi emphasizes fairness, transparency, and low barriers to entry, allowing anyone to participate by registering with Bittensor's native token. The ecosystem includes open-source strategy development, automated wealth generation tools, and integrations with data providers, aiming to empower both individuals and institutions with AI-driven financial insights.","tags":["trading","ai","blockchain","decentralized-finance"],"twitter":"@taoshiio"},{"netuid":9,"subnet_name":"iota","github_repo":"https://github.com/macrocosm-os/iota","subnet_contact":"support@macrocosmos.ai","subnet_url":"https://iota.macrocosmos.ai/","logo_url":"https://www.macrocosmos.ai/images/mc_logo_black.png","discord":"macrocrux","description":"The world's first permissionless pipeline parallel training architecture","additional":null,"summary":"iota (Incentivized Orchestrated Training Architecture) is a decentralized framework for pretraining large language models using a network of heterogeneous, unreliable, and permissionless machines incentivized by tokens. The system distributes model layers across miners, who process activations and periodically upload their local weights, with all communication managed by an orchestrator and storage handled via a shared S3 bucket. Validators spot-check miners to ensure correct work. The architecture is designed to accelerate training and reduce hardware requirements through data- and pipeline-parallelism, with current runs supporting a 1.5B parameter model and plans to scale to larger models. Participants can join as miners or validators, and a dashboard provides real-time network metrics.","tags":["ai-training","compute","decentralized","incentive"],"twitter":null},{"netuid":10,"subnet_name":"Swap","github_repo":"https://github.com/Swap-Subnet/swap-subnet","subnet_contact":"","subnet_url":"https://www.taofi.com/pool","logo_url":"https://www.taofi.com/images/SN10-Swap-Dark.png","discord":"","description":"Swap is onboarding users to Bittensor.","additional":null,"summary":"swap (sn10 on Bittensor) is a project designed to incentivize miners to provide liquidity to the TAO<>USDC pool on the Taofi platform. It implements a scoring mechanism where miners are evaluated based on the fees their liquidity positions have generated over the past 24 hours, encouraging active and effective liquidity provision. The project is open-source under the MIT license and provides clear instructions for installation and development setup, targeting contributors interested in decentralized finance and liquidity mining within the Bittensor ecosystem.","tags":["liquidity","defi","bittensor"],"twitter":null},{"netuid":11,"subnet_name":"Dippy Studio","github_repo":"https://github.com/impel-intelligence/dippy-studio-bittensor","subnet_contact":"support@dippy.ai","subnet_url":"https://dippy.studio","logo_url":"","discord":"","description":"Enterprise Grade Generative Media Platform on Bittensor","additional":null,"summary":"Dippy Studio is an enterprise-grade generative media platform built on the Bittensor network, designed to deliver high-performance, multi-modal AI media generation including images, video, and audio. Leveraging its own custom inference engine and operating on Bittensor subnet 11, Dippy Studio provides production-ready, scalable, and cost-effective generative media services with unmatched speed. The platform supports both miners and validators for deterministic, high-quality inference, and aims to serve millions of users and onboard AI startups with decentralized media infrastructure. Dippy Studio is live on testnet and offers early access, with a roadmap to expand modalities and serve as a backbone for next-generation creative applications.","tags":["ai-media","compute","bittensor","inference"],"twitter":"@dippy_ai"},{"netuid":12,"subnet_name":"Compute Horde","github_repo":"https://github.com/backend-developers-ltd/ComputeHorde/","subnet_contact":"","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"computehorde is a specialized subnet (subnet 12) within the Bittensor network, designed to provide scalable, decentralized, and trusted GPU computing power for validators across other Bittensor subnets. By transforming untrusted GPUs from miners into reliable compute resources, computehorde reduces dependency on centralized services and enables cost-effective, large-scale validation. Key features include fair and verified work mechanisms, scalable mining with multiple executors per miner, hardware class-based resource allocation, a developer SDK for easy integration, collateral-based trust for organic jobs, and an optional DDoS shield for miners. The project aims to support a wide range of GPU types and offers a robust scoring and incentive system to ensure quality and accountability.","tags":["compute","decentralized","gpu","bittensor"],"twitter":null},{"netuid":13,"subnet_name":"Data Universe","github_repo":"https://github.com/macrocosm-os/data-universe","subnet_contact":"support@macrocosmos.ai","subnet_url":"https://www.macrocosmos.ai/gravity","logo_url":"https://www.macrocosmos.ai/images/mc_logo_black.png","discord":"macrocrux","description":"Scraping the world's social media data","additional":null,"summary":"Macrocosmos Data Universe is a large-scale, open-access platform that scrapes and aggregates real-time and historical social media data from platforms like X (formerly Twitter), Reddit, and YouTube. Designed for precision, speed, and scalability, it offers over 55 billion structured data rows with up to 80 million new entries added daily. Users can access, analyze, and visualize this data for applications such as social listening, AI model training, forecasting, and market analysis. The platform features tools like Gravity for targeted data scraping and Nebula for interactive 3D data visualization, and provides both ready-made datasets and flexible APIs for integration into business and AI workflows.","tags":["data-aggregation","ai-training","social-media","analytics"],"twitter":"@macrocosmosai"},{"netuid":14,"subnet_name":"TAOHash","github_repo":"https://github.com/latent-to/taohash","subnet_contact":"taohash@latent.to","subnet_url":"https://taohash.ai/","logo_url":"https://v2-dev.taohash.ai/assets/taohash_logo-4f75d956.png","discord":"https://discord.gg/wCvqvKJR7P","description":"TAOHash is a Subnet for decentralizing PoW mining hashrate- rental and financialization. Validators incentivize miners to pool hashrate with them, rewarding them with Alpha based on the value of that hashrate.","additional":null,"summary":"taohash is a Bittensor subnet (subnet 14) focused on creating a decentralized, incentivized marketplace for Bitcoin mining hashrate. It enables miners to contribute BTC mining power and earn rewards through two systems: direct Bitcoin payouts via the Tides protocol (no registration required) and subnet-specific alpha tokens for registered Bittensor miners, which are convertible to TAO, Bittensor's main currency. Validators assess and rank miners based on their contributed share value, ensuring fair and performance-based distribution of rewards. The project aims to evolve into a public, smart contract-backed hashrate marketplace and is extensible to other mining projects where miner performance can be efficiently verified.","tags":["compute","mining","marketplace","bittensor"],"twitter":null},{"netuid":15,"subnet_name":"BitQuant","github_repo":"https://github.com/OpenGradient/BitQuant-Subnet","subnet_contact":"team@opengradient.ai","subnet_url":"https://www.bitquant.io/","logo_url":"https://pbs.twimg.com/profile_images/1973764178906087424/IonHN0Oq_400x400.jpg","discord":"","description":"BitQuant is the subnet of AI agents powering on-chain DeFi intelligence","additional":null,"summary":"Bitquant is an AI-powered, decentralized framework for quantitative analysis in DeFi and crypto markets, operating as subnet 15 on the Bittensor network. Developed by Opengradient, it enables real-time market analytics, portfolio optimization, risk assessment, and strategy evaluation through natural language interfaces. The platform incentivizes high-quality AI agents to deliver actionable financial insights, supports both validator and miner nodes, and provides composable, on-chain quantitative strategies. Bitquant's agentic framework allows users to analyze tokens, DeFi pools, and portfolio risks using both on-chain and off-chain data, fostering a robust ecosystem for decentralized financial intelligence.","tags":["ai-agent","quantitative-analysis","defi","analytics"],"twitter":null},{"netuid":16,"subnet_name":"BitAds","github_repo":"https://github.com/FirstTensorLabs/BitAds","subnet_contact":"","subnet_url":"https://bitads.ai","logo_url":"https://raw.githubusercontent.com/FirstTensorLabs/BitAds-Assets/refs/heads/main/Logo-white-green-black.png","discord":"https://discord.gg/qasY3HA9F9","description":"BitAds is a decentralized, Proof of Sale marketing network where merchandisers stake or rent ALPHA to own marketing bandwidth, and miners earn on verified sales.","additional":"https://x.com/bitads_ai","summary":"Bitkoop is a decentralized, community-powered coupon platform that transforms the process of finding online discount codes by incentivizing users (miners) to discover and submit valid coupons, which are then independently verified by validators. This system ensures only working, up-to-date discount codes are available, addressing common issues of expired or fake offers found on traditional coupon sites. Bitkoop leverages affiliate commissions for revenue, aiming to deliver a transparent, trustworthy alternative in the multi-billion-dollar coupon industry, while rewarding contributors and maintaining a self-sustaining ecosystem.","tags":["coupon","decentralized","affiliate","validation"],"twitter":"@bitkoop"},{"netuid":17,"subnet_name":"404—GEN","github_repo":"https://github.com/404-Repo/three-gen-subnet","subnet_contact":"404@404.xyz","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"404—gen is an open-source platform designed to democratize 3D content creation by leveraging the Bittensor decentralized incentive network. It accelerates the generation of 3D assets, enabling creators of all skill levels to build immersive virtual worlds, games, and AR/VR/XR experiences. The project features a prompt generation system powered by large language models (LLMs) and supports both organic and dataset-driven prompt sources. Validators can participate in the subnet to help generate and curate prompts, with tools provided for monitoring, setup, and prompt collection. 404—gen aims to foster innovation in AI-native games and runtime-generated virtual experiences, making 3D asset creation accessible to non-coders and game developers.","tags":["3d-generation","ai","content-creation","decentralized-network"],"twitter":null},{"netuid":18,"subnet_name":"Zeus","github_repo":"https://github.com/Orpheus-AI/Zeus","subnet_contact":"","subnet_url":"https://www.zeussubnet.com/","logo_url":"https://raw.githubusercontent.com/Orpheus-AI/Zeus/refs/heads/main/static/zeus-icon.png","discord":"wouter_orpheusai","description":"Pushing weather forecasts beyond state-of-the-art","additional":"Powered by Ørpheus AI","summary":"Zeus is a decentralized, high-performance weather and environmental forecasting platform built as subnet 18 on the Bittensor network. Leveraging advanced AI models and the extensive ERA5 reanalysis dataset, Zeus enables low-latency, scalable, and accurate environmental predictions for mission-critical systems. The platform incentivizes continuous improvement and research integration through a competitive, decentralized network of miners and validators, ensuring high-quality forecasts and adaptability to evolving market needs. Contributors are rewarded with Bittensor's native currency, TAO, and all data is publicly accessible, supporting transparency and innovation in environmental prediction.","tags":["prediction","ai","decentralized","environmental-data"],"twitter":"@zeussubnet"},{"netuid":19,"subnet_name":"Nineteen.ai","github_repo":"https://github.com/namoray/nineteen/","subnet_contact":"contact@rayonlabs.ai","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"sn19 (subnet 19) is a decentralized AI inference network built on Bittensor, enabling scalable, censorship-resistant access to open-source AI models such as large language models and image generators. The network operates through a system of miners, who run models and are incentivized based on volume, speed, and quality of responses, and validators, who score and monetize access to these models. sn19 emphasizes full decentralization, with no reliance on centralized APIs, and supports dynamic task allocation, allowing miners to flexibly choose which AI tasks to serve. The project aims to democratize AI access while maintaining high reliability and performance through organic scoring and decentralized validation.","tags":["ai-inference","decentralization","compute","bittensor"],"twitter":null},{"netuid":20,"subnet_name":"Bounty Hunter","github_repo":"https://github.com/RogueTensor/bitagent_subnet","subnet_contact":"bountyhunter@rizzo.network","subnet_url":"https://aiboards.io","logo_url":"https://aiboards.io/favicon.png","discord":"","description":"Bounty-driven AI Achievements!","additional":"AI giants burn cash. Bounties spark revolutions!","summary":"Bitagent is a competitive subnet (#20) on the Bittensor network designed to simplify and automate tasks and workflows by integrating large language models (LLMs) with popular applications such as web browsers, Discord, and custom integrations. It enables users to deploy intelligent agents for personalized assistance and task automation, supporting both technical and creative bounties through a decentralized, reward-based system. Bitagent features automated and community validation, supports multiple winners per bounty, and requires no API or subscription fees. The project emphasizes open participation, with clear hardware requirements for validators and miners, and showcases real-world applications like gogoagent.ai and msptech.ai.","tags":["ai-agent","automation","bounty","bittensor"],"twitter":null},{"netuid":21,"subnet_name":"OMEGA Any-to-Any","github_repo":"https://github.com/omegalabsinc/omegalabs-anytoany-bittensor","subnet_contact":"contact@omega-labs.ai","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"Omega Labs' 'omega any-to-any' is a decentralized, open-source AI project built on the Bittensor blockchain, focused on developing state-of-the-art multimodal models that can learn and generate across various data types, starting with voice-to-voice generation. The project incentivizes AI researchers and contributors through Bittensor's reward infrastructure, promoting innovation, transparency, and community-driven development. Its roadmap emphasizes robust evaluation metrics, fair reward mechanisms, and real-world application layers, aiming to create a self-sustaining research lab and a thriving ecosystem for voice-first AI solutions.","tags":["ai","multimodal","compute","voice","blockchain"],"twitter":null},{"netuid":22,"subnet_name":"Desearch","github_repo":"https://github.com/datura-ai/desearch","subnet_contact":"giga@desearch.ai","subnet_url":"https://desearch.ai","logo_url":"https://desearch.ai/assets/logo-icon-C18R0lAC.png","discord":"https://discord.gg/P44zrJmdFy","description":"Decentralized search engine","additional":null,"summary":"Desearch is an AI-powered, decentralized search engine built on the Bittensor network, designed to deliver unbiased and verifiable search results. It aggregates and analyzes metadata from diverse sources such as X (formerly Twitter), Reddit, Arxiv, and the broader web, providing real-time, contextual, and sentiment-aware search experiences. The platform is customizable, user-friendly, and suitable for both technical and non-technical users, supporting integration via API for developers and AI builders. Desearch leverages a community-driven approach, with miners and validators continuously optimizing search quality and reliability.","tags":["search","ai","data-aggregation"],"twitter":null},{"netuid":23,"subnet_name":"Trishool","github_repo":"https://github.com/TrishoolAI/trishool-subnet","subnet_contact":"nav@astroware.ai","subnet_url":"https://trishool.ai","logo_url":"https://trishool.ai/_next/image?url=%2Ftrishool-logo-small.png&w=96&q=75","discord":"https://discord.com/channels/799672011265015819/1437447445176127618","description":"Trishool is the AI alignment protocol built on Bittensor","additional":null,"summary":"Trishool is a decentralized AI safety platform built as a Bittensor subnet, designed to detect and mitigate misalignment in large language models (LLMs). It creates a competitive environment where global participants (miners) submit seed instructions to probe AI models for problematic behaviors such as deception, manipulation, sycophancy, and power-seeking. Validators evaluate these submissions using the Petri alignment auditing agent in isolated sandboxes, with results verified and rewarded on-chain in TAO tokens. The system features robust anti-cheating measures, automated validation, and a continuous evolution cycle where successful detection strategies are integrated into the core. Trishool aims to provide scalable, real-time oversight and alignment of AI systems, leveraging decentralized scoring and multi-source verification to reduce risks as AI capabilities rapidly advance.","tags":["ai-safety","ai-agent","decentralized","bittensor","security"],"twitter":null},{"netuid":24,"subnet_name":"Quasar","github_repo":"https://github.com/SILX-LABS/QUASAR-SUBNET/","subnet_contact":"-","subnet_url":"https://silxinc.com/","logo_url":"https://silxinc.com/_next/image?url=%2Flogo-white.png&w=640&q=75","discord":"https://discordapp.com/channels/799672011265015819/1214246819886931988","description":"Bittensor subnet built to crush the long-context barrier.","additional":"-","summary":"Quasar is a decentralized AI project focused on advancing long-context language models by leveraging the Bittensor network. It introduces foundation models capable of processing millions of tokens in a single context, enabling detailed reasoning across vast datasets such as books, codebases, and legal documents. The project operates as a Bittensor subnet where independent miners train and compete with high-performance models, and validators audit their outputs using real-world benchmarks. Rewards in $TAO incentivize accuracy and the ability to handle longer contexts. Quasar emphasizes open-source collaboration, efficient decentralized training, and transparent evaluation, aiming to push the boundaries of scalable, decentralized AI reasoning.","tags":["ai-model","decentralized","compute","bittensor"],"twitter":"@quasarmodels"},{"netuid":25,"subnet_name":"Mainframe","github_repo":"https://github.com/macrocosm-os/mainframe","subnet_contact":"brian@macrocosmos.ai","subnet_url":"https://macrocosmos.ai/sn25","logo_url":"https://www.macrocosmos.ai/images/mc_logo_black.png","discord":"mccrinbc","description":"Powering decentralized science on Bittensor","additional":null,"summary":"Macrocosmos' Subnet 25 (Mainframe) is a decentralized scientific computing platform built on Bittensor, focused on leveraging distributed GPU compute for complex life sciences problems, starting with protein folding and protein-ligand docking—key processes in drug discovery. By incentivizing miners to deliver optimal molecular configurations using industry-standard tools like GROMACS and OpenMM, Mainframe reduces computational costs and accelerates research for academia, biotech, and pharma. The platform is expanding to support a broader range of scientific computation tasks, including density functional theory (DFT), and has already completed hundreds of thousands of protein-folding jobs since its June 2024 launch. Strategic partnerships, such as with Rowan Scientific, further enhance its capabilities in AI-driven chemistry and drug development.","tags":["compute","life-science","decentralized-science","drug-discovery"],"twitter":"@macrocosmosai"},{"netuid":26,"subnet_name":"Kinitro","github_repo":"https://github.com/threetau/kinitro","subnet_contact":"contact@kinitro.ai","subnet_url":"kinitro.ai","logo_url":"https://kinitro.ai/k-tiny.png","discord":"https://discord.gg/6sFrH9B4Pa","description":"Advancing Embodied Intelligence With Directed Incentives","additional":"cerebrum machinae","summary":"Kinitro is an incentivized platform designed to foster the development and evaluation of embodied AI agents capable of tackling diverse tasks across various environments. The system operates through a decentralized process where miners submit agents, validators perform real-time rollouts and evaluations, and rewards are distributed based on agent performance. The architecture includes a FastAPI backend, validator nodes, evaluator clusters orchestrated with Ray and Kubernetes, and miner tools that integrate with the Bittensor blockchain. All activities are transparent and can be monitored via a public dashboard, with comprehensive documentation and support available for participants.","tags":["ai-agent","incentive","blockchain","evaluation"],"twitter":null},{"netuid":27,"subnet_name":"Nodexo","github_repo":"https://github.com/neuralinternet/compute-subnet","subnet_contact":"neuralinternet@gmail.com","subnet_url":"nodexo.ai","logo_url":"https://console.nodexo.ai/assets/images/logo/logo-dark.svg","discord":"https://discord.com/invite/nodexo","description":"Decentralized AI compute platfrom","additional":null,"summary":"The Bittensor NI Compute Subnet (Subnet 27) is a decentralized compute market that enables miners to contribute GPU resources and earn performance-based rewards. Validators measure and verify the performance of these miners, ensuring efficient, trustless, and permissionless allocation of GPU compute power. Designed for machine learning workloads, the subnet operates on the Bittensor blockchain, incentivizing resource providers and facilitating scalable, on-demand GPU access without reliance on centralized providers. The project supports both miners and validators, provides automated and manual installation options, and emphasizes the use of dedicated hardware for optimal participation.","tags":["compute","decentralized","gpu","machine-learning"],"twitter":null},{"netuid":28,"subnet_name":"Unknown","github_repo":null,"subnet_contact":null,"subnet_url":null,"logo_url":null,"discord":null,"description":null,"additional":null,"summary":null,"tags":null,"twitter":null},{"netuid":29,"subnet_name":"Coldint","github_repo":"https://github.com/coldint/coldint_validator","subnet_contact":"","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"Coldint is a collaborative, distributed, and incentivized training subnet on the Bittensor network (subnet 29) focused on advancing state-of-the-art machine learning model training and research. The project incentivizes miners to contribute improved models, code, and insights, fostering both individual and collective progress. Rewards are given for model performance improvements, code contributions, bug fixes, and valuable suggestions, with an emphasis on transparency, fairness, and open sharing of results. Coldint aims to accelerate innovation by enabling continuous, high-quality iterations and combining individual efforts into superior collective models, all while maintaining public leaderboards and open-source codebases.","tags":["ai-training","incentive","collaborative","bittensor"],"twitter":null},{"netuid":30,"subnet_name":"Wahoot","github_repo":"https://github.com/wahoo-predict/wahoot","subnet_contact":"wahootsubnet@gmail.com","subnet_url":"https://wahoopredict.com","logo_url":"https://i.imgur.com/6a3bAmI.png","discord":"wahootsubnet","description":"The largest prediction market on Bittensor.","additional":"https://x.com/wahoopredict","summary":"wahooτ is a prediction market platform that enables users to trade on real-world events—such as sports, politics, and economics—using simple yes/no bets with real-time odds. Built on top of Bittensor, it rewards users with TAO/alpha tokens based on their trading performance, not coding skills. The platform is accessible via browser, requires no coding, and offers full API access for advanced users. Validators track and score user performance transparently, and rewards are distributed accordingly. wahooτ aims to democratize prediction markets and Bittensor mining by making participation easy and rewarding for everyone.","tags":["prediction","trading","bittensor"],"twitter":null},{"netuid":31,"subnet_name":"Halftime","github_repo":"","subnet_contact":"","subnet_url":"","logo_url":"https://x.ai/images/noise.png","discord":"","description":"Halftime is a Bittensor subnet for decentralized multimodal intelligence derived from the xAI Halftime project, focused on context-aware analysis for media and advertising. Planned go-live Q2 2026.","additional":null,"summary":"Candles Subnet is a decentralized cryptocurrency candle prediction network built on Bittensor, where miners compete to predict the direction and closing values of cryptocurrency price candles (hourly, daily, and weekly). Validators request and score these predictions against real market data, rewarding miners based on their prediction accuracy. The project supports custom prediction files, automated and manual miner setup, and offers a web interface for generating prediction CSVs. Its primary trading pair is TAO-USD, and it features both mainnet and testnet environments. The project is open source under the MIT license and encourages community participation.","tags":["prediction","cryptocurrency","decentralized-network","bittensor"],"twitter":null},{"netuid":32,"subnet_name":"ItsAI","github_repo":"https://github.com/It-s-AI/llm-detection","subnet_contact":"support@its-ai.org","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"It's AI is a decentralized AI detection tool built on the Bittensor network, designed to accurately identify whether text is human-written or AI-generated. Leveraging advanced validation mechanisms and benchmarking as the most accurate AI detector on the RAID benchmark, the platform offers a suite of products including a web app, Chrome extension, API, and a unique 'Britishizer' tool. It's AI targets a rapidly growing market, aiming to provide robust, real-world solutions for AI content detection, with a legal entity established in Dubai to facilitate growth and payment processing beyond the Bittensor ecosystem.","tags":["ai-detection","validation","decentralized-app"],"twitter":"@ai_detection"},{"netuid":33,"subnet_name":"ReadyAI","github_repo":"https://github.com/afterpartyai/bittensor-conversation-genome-project","subnet_contact":"david@readyai.ai","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"readyai is an open-source project that provides a low-cost, resource-efficient data structuring and semantic tagging pipeline designed for individuals and businesses to transform raw data into structured, AI-ready formats. Built on the Bittensor network, it leverages distributed mining and validation, where miners process and tag data using large language models (LLMs) like OpenAI's GPT-4o, and validators establish ground truth and score miner outputs. The system incentivizes data contribution and integrity through a reward mechanism, and supports integration with vector databases and AI applications. readyai is highly configurable, supports multiple LLM providers, and is designed for scalability and ease of deployment.","tags":["ai-data-pipeline","mining","validation","bittensor"],"twitter":null},{"netuid":34,"subnet_name":"BitMind","github_repo":"https://github.com/BitMind-AI/bitmind-subnet","subnet_contact":"intern@bitmind.ai","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"GAS (Generative Adversarial Subnet) is a Bittensor subnet designed to advance AI safety by leveraging a generative adversarial network (GAN)-inspired architecture. It features a competitive ecosystem where generative miners create synthetic media and discriminative miners develop detection models to identify fakes. Validators orchestrate challenges and scoring, ensuring continuous improvement of both detection and generation capabilities. The open, incentivized structure rewards accuracy and innovation, fostering rapid evolution of detection tools and high-quality synthetic data generation. GAS aims to stay ahead of evolving fake content threats by promoting dynamic, community-driven progress.","tags":["ai-safety","gan","mining","validation"],"twitter":null},{"netuid":35,"subnet_name":"Cartha","github_repo":"https://github.com/General-Tao-Ventures/cartha-cli","subnet_contact":"","subnet_url":"https://www.0xmarkets.io/","logo_url":"https://storage.googleapis.com/cartha-assets/cartha_logo.png","discord":"https://discord.com/invite/sZbt93ANGG","description":"The future of trading is decentralized. We bring the world's most powerful financial markets to everyone.","additional":"https://x.com/0x_Markets","summary":"0xmarkets is a decentralized exchange (DEX) platform designed to provide global, permissionless access to trading a wide range of financial assets, including cryptocurrencies, currencies, and commodities. Powered by the Cartha subnet on the Bittensor network, 0xmarkets offers deep, dynamically allocated liquidity and institutional-grade trading depth, aiming to rival traditional CFD platforms. Liquidity providers (miners) can earn dual rewards in the form of trading fees and subnet alpha tokens. The platform emphasizes fairness, efficiency, and accessibility, allowing users to trade perpetual contracts and participate in liquidity provision without traditional barriers or restrictions.","tags":["trading","liquidity-provider","perpetual","dex"],"twitter":"@0x_Markets"},{"netuid":36,"subnet_name":"Web Agents - Autoppia","github_repo":"https://github.com/autoppia/autoppia_web_agents_subnet","subnet_contact":"","subnet_url":"https://autoppia.com","logo_url":"github.com/autoppia/autoppia_web_agents_subnet/blob/main/icon48.png","discord":"","description":null,"additional":null,"summary":"Autoppia is an AI-powered automation platform that leverages autonomous web agents and Bittensor's subnet 36 to automate complex business workflows across the web. Its Infinite Web Arena (IWA) provides a dynamic, generative AI benchmark for evaluating and incentivizing the development of adaptive web agents capable of handling real-world web tasks. Unlike traditional RPA tools, Autoppia's agents can understand goals, adapt to changing interfaces, and make intelligent decisions without explicit programming, enabling robust, permissionless, and continuously improving automation for a wide range of business processes.","tags":["ai-agent","automation","benchmark","bittensor"],"twitter":"@autoppiaai"},{"netuid":37,"subnet_name":"Aurelius","github_repo":"https://github.com/Aurelius-Protocol/aurelius-whitepaper","subnet_contact":"aurelius.subnet@gmail.com","subnet_url":"https://aureliusaligned.ai","logo_url":"https://raw.githubusercontent.com/Aurelius-Protocol/aurelius-whitepaper/main/Logo%20Final.png","discord":"discord.gg/fsRZgtTt9B","description":"Decentralized protocol for producing alignment datasets, supporting research, governance, and enterprise AI safety.","additional":null,"summary":"Aurelius is a decentralized protocol focused on scaling AI alignment through adversarial evaluation of large language models (LLMs). It coordinates independent actors—miners, validators, and the tribunate—to generate, evaluate, and benchmark LLM outputs across key alignment dimensions. Miners create strategies to red-team LLMs, while validators score and categorize misalignment instances based on transparent criteria set by the tribunate. The protocol incentivizes contributors to discover and label misalignments, producing high-quality datasets for fine-tuning, auditing, and benchmarking LLMs, with applications in enterprise and scientific contexts.","tags":["ai-alignment","ai-agent","data-marketplace","decentralized-protocol"],"twitter":"@aureliusaligned"},{"netuid":38,"subnet_name":"Unknown","github_repo":null,"subnet_contact":null,"subnet_url":null,"logo_url":null,"discord":null,"description":null,"additional":null,"summary":"The Distributed Training Subnet is an open-source project designed to enable decentralized, distributed machine learning model training across a network of participants. Built on top of the Bittensor protocol, it leverages peer-to-peer technologies and the Hivemind library to coordinate collaborative training, allowing users to contribute compute resources as miners or validators. The system supports auto-updating nodes, integrates with platforms like Weights & Biases and Hugging Face, and uses a decentralized hash table (DHT) for communication. The project aims to democratize access to large-scale model training by distributing workloads and incentives across a global network.","tags":["ai-training","compute","decentralized","bittensor"],"twitter":null},{"netuid":39,"subnet_name":"basilica","github_repo":"https://github.com/tplr-ai/basilica","subnet_contact":"info@tplr.ai","subnet_url":"","logo_url":"https://www.covenant.ai/images/basilica.png","discord":"formalised_tensor","description":"sacred compute","additional":null,"summary":"Basilica is a decentralized platform that establishes a trustless marketplace for GPU compute resources. It features secure hardware verification, remote validation of computational tasks, and native integration with the Bittensor network for consensus and weight allocation. The system includes components for validator management, miner orchestration, and executor agents that handle secure task execution on GPU machines. Basilica also provides an API gateway for authenticated, load-balanced access to its validator network, enabling efficient and scalable distributed compute resource management.","tags":["compute","decentralized-marketplace","gpu","bittensor"],"twitter":null},{"netuid":40,"subnet_name":"Chunking","github_repo":"https://github.com/VectorChat/chunking_subnet","subnet_contact":"","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"The project provides a blockchain platform focused on validator and miner participation, offering interactive benchmarking tools to assess performance. It tracks metrics such as chunks produced, tokens processed, recall, and precision, and compares its performance relative to competitors and other AI-based solutions. The platform emphasizes transparency through dashboards and detailed statistics, catering to users interested in network performance and operational analytics.","tags":["blockchain","validator","miner","benchmark"],"twitter":null},{"netuid":41,"subnet_name":"Sportstensor","github_repo":"https://github.com/sportstensor/sn41","subnet_contact":"sportstensor@gmail.com","subnet_url":"https://sportstensor.com","logo_url":"https://beta.almanac.market/assets/favicons/st-favicon-32x32.png","discord":"","description":"Beating the odds through collective intelligence.","additional":null,"summary":"Sportstensor is a decentralized competition network for sports prediction, leveraging collective intelligence and ensemble learning to aggregate diverse AI models for more accurate outcomes. Participants, known as miners, deploy predictive models or manual strategies to trade on sports markets via the Almanac interface, earning rewards based on the accuracy and profitability of their predictions. The system uses a two-phase optimization mechanism to fairly distribute token rewards, incentivizing high-quality signals while preventing gaming. Validators score miners' performance and manage reward allocations on-chain. Sportstensor integrates with Bittensor and Polymarket, and has paid out over $2 million to contributors.","tags":["prediction","ai-ensemble","trading","decentralized-network"],"twitter":"@sportstensor"},{"netuid":42,"subnet_name":"Gopher","github_repo":"https://github.com/gopher-lab/subnet-42","subnet_contact":"grant@masa.ai","subnet_url":"https://www.gopher-ai.com/","logo_url":"https://i.postimg.cc/7YdH4rRs/gopher-icon.png","discord":"","description":"Access a universe of AI-ready data on demand","additional":"Build anything anywhere with the world's data","summary":"Gopher is a high-performance layer 1 blockchain purpose-built for AI-powered, autonomous trading. It provides institutional-grade data infrastructure and a proprietary agent framework for building, deploying, and optimizing AI trading strategies across crypto, stocks, forex, commodities, and more. Gopher's emission-driven economy automatically rewards top-performing strategies, creating a self-optimizing market for alpha generation. The platform emphasizes security through hardware-level encryption and globally distributed infrastructure, while enabling builders, validators, miners, and capital providers to participate and be rewarded via the native $GOAI token. Gopher aims to democratize access to advanced trading tools and data, unlocking the $5-trillion hedge fund industry for everyone.","tags":["blockchain","trading","ai-agent","data-infrastructure"],"twitter":"@gopher_ai"},{"netuid":43,"subnet_name":"Graphite","github_repo":"https://github.com/GraphiteAI/Graphite-Subnet","subnet_contact":"team@graphite-ai.net","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"GraphiteAI is a decentralized network built on Bittensor, specializing in solving complex graph optimization problems such as the Traveling Salesman Problem (TSP). By leveraging decentralized intelligence and scalable computational power, Graphite connects miners and validators to efficiently process and solve NP-hard graph challenges. The platform supports multiple input methods and provides a suite of algorithms, including heuristics and deep learning-based approaches, while incentivizing miners to develop high-performance solvers through a reward mechanism. GraphiteAI aims to democratize access to advanced graph solutions, making them accessible to both individuals and organizations through an intuitive interface and comprehensive support.","tags":["compute","optimization","ai-network"],"twitter":"@graphitesubnet"},{"netuid":44,"subnet_name":"Score","github_repo":"https://github.com/score-technologies/score-vision","subnet_contact":"hello@wearescore.com","subnet_url":"https://www.wearescore.com/","logo_url":"https://www.wearescore.com/android-chrome-512x512.png","discord":"","description":"Making every camera intelligent","additional":null,"summary":"Score Vision is a decentralized computer vision framework built on Bittensor, designed to make advanced video analysis scalable, accessible, and cost-effective. Initially targeting the football industry, Score Vision leverages lightweight validation techniques and incentive mechanisms to drastically reduce the time and expense of tasks like game state recognition, which traditionally require extensive manual annotation. The system distributes video processing across miners and validators, ensuring real-time, accurate analysis with minimal computational overhead. While its first application is in football analytics, betting, and broadcasting, the framework is extensible to other sports and broader computer vision domains such as surveillance and retail analytics.","tags":["ai","computer-vision","decentralized","sports-analytics"],"twitter":"@webuildscore"},{"netuid":45,"subnet_name":"Talisman AI","github_repo":"https://github.com/Team-Rizzo/talisman-ai","subnet_contact":"tai@rizzo.network","subnet_url":"https://ai.talisman.xyz","logo_url":"https://styles.redditmedia.com/t5_53lwgb/styles/communityIcon_vb7hazik5aqf1.jpg","discord":"","description":null,"additional":null,"summary":"Talisman AI is an AI-powered perception subnet (subnet 45) on Bittensor focused on delivering real-time trading insights by analyzing social media sentiment, on-chain activity, and market data relevant to the Bittensor ecosystem. It employs a multi-layered architecture where miners use large language models to assess the relevance, sentiment, and content type of social media posts, while validators independently verify the analysis for accuracy and quality. The system rewards miners for validated contributions and penalizes invalid batches, ensuring high-quality signal data. Future phases aim to expand data sources and deliver actionable trading or staking recommendations directly to users' wallets.","tags":["ai-agent","trading","sentiment-analysis"],"twitter":null},{"netuid":46,"subnet_name":"RESI","github_repo":"https://github.com/resi-labs-ai/resi","subnet_contact":"seby@resilabs.ai","subnet_url":"resilabs.ai","logo_url":"https://resi-public.nyc3.cdn.digitaloceanspaces.com/color_3_r.png","discord":"https://discord.gg/9Hxmh7H6Pt","description":"The Real Estate Oracle","additional":"Real Estate Super Intelligence","summary":"Resi is a decentralized real estate data collection network built on Bittensor's subnet 46 by resilabs.ai, aiming to create the world's largest open real estate database. By leveraging a miner-validator architecture, Resi incentivizes contributors to gather and validate comprehensive, up-to-date property data from diverse sources such as Zillow, Redfin, and public records. The platform's open data approach enables AI-driven applications like seller intent prediction, market analysis, and CRM enhancement, breaking down traditional data silos and fostering innovation in real estate analytics. Resi's roadmap includes expanding to commercial and international property data, supporting third-party developers, and integrating advanced AI training services.","tags":["real-estate","data-collection","ai","decentralized"],"twitter":null},{"netuid":47,"subnet_name":"Reboot","github_repo":"https://github.com/reboot-org/reboot-subnet","subnet_contact":"lambert@getreboot.org","subnet_url":"https://getreboot.org/","logo_url":"","discord":"","description":"Reboot Subnet – Robotics AI Network is a specialized Bittensor subnet for decentralized, AI-powered robotics services. It enables developers to build, deploy, and validate intelligent robotic systems on a blockchain-backed, incentive-driven network — combining distributed AI computation with secure consensus.","additional":null,"summary":"Reboot is a decentralized robotics AI network built as a specialized subnet on Bittensor, enabling autonomous robots to learn, adapt, and optimize their performance through blockchain-backed, incentive-driven collaboration. The platform provides a framework for AI-powered robot control, sensor data processing, multi-agent coordination, and distributed task execution, all validated by a peer-to-peer consensus mechanism. With features like advanced pathfinding, safety validation, modular architecture, and continuous learning protocols, Reboot aims to advance intelligent robotics by combining distributed AI computation with secure, transparent validation and rewards for breakthrough solutions.","tags":["robotic","ai-network","compute","validation"],"twitter":null},{"netuid":48,"subnet_name":"Quantum Compute","github_repo":"https://github.com/qbittensor-labs/quantum-compute","subnet_contact":"qbittensorlabs@gmail.com","subnet_url":"https://www.qbittensorlabs.com/","logo_url":"https://i.imgur.com/fAC1VJY.jpeg","discord":"qbittensorlabs","description":"Quantum Computing","additional":null,"summary":"Qbittensor Labs is pioneering decentralized quantum computing by integrating quantum resources into the Bittensor ecosystem through two specialized subnets: Quantum Innovate (sn63) and Quantum Compute (sn48). The project democratizes access to quantum computers and high-performance quantum simulations, offering free and subsidized usage via openquantum.com. Quantum Innovate focuses on advancing quantum algorithms through community-driven challenges, while Quantum Compute creates an open marketplace for executing real quantum circuits on physical quantum hardware and simulators. The platform targets researchers, developers, enterprises, and enthusiasts, providing seamless integration with existing quantum frameworks and transparent, community-driven development. Premium features and a two-sided market ensure sustainability and scalability.","tags":["compute","quantum","decentralized-infrastructure"],"twitter":"@qbittensorlabs"},{"netuid":49,"subnet_name":"Nepher","github_repo":"","subnet_contact":"","subnet_url":"","logo_url":"https://tournaments.nepher.ai/logo.png","discord":"","description":null,"additional":null,"summary":"Polaris Cloud Subnet (netuid 49) is a decentralized AI compute network built on Bittensor, where miners contribute GPU/CPU resources and validators ensure network integrity through a robust, performance-based reward system. The network enforces strict quality control, requiring a minimum proof-of-work (pow) threshold for participation, and uses a multiplier-based scoring architecture that rewards uptime, container activity, and network stake. Non-compliant resources face penalties, with burned penalties redistributed to incentivize compliance. The system is production-ready, transparent, and designed to maintain high-quality compute resources for decentralized AI workloads.","tags":["compute","ai","decentralized-network"],"twitter":null},{"netuid":50,"subnet_name":"Synth","github_repo":"https://github.com/mode-network/synth-subnet","subnet_contact":"","subnet_url":"https://synthdata.co","logo_url":"https://taostats.io/images/subnets/50.webp?w=96&q=75","discord":"","description":"Predictive intelligence for financial markets and beyond","additional":null,"summary":"Synth is a decentralized subnet on the Bittensor network that generates high-fidelity synthetic price data for cryptocurrencies and other financial assets. By leveraging a competitive ecosystem of AI models (miners), Synth produces probabilistic price path simulations that capture realistic market dynamics, such as volatility clustering and fat tails, enabling more accurate forecasting than traditional single-point predictions. These forecasts are evaluated and rewarded based on their accuracy using the Continuous Ranked Probability Score (CRPS). Synth's data powers a range of financial applications, including options trading, risk management, and portfolio optimization, and is accessible via API for integration with on-chain AI agents and trading systems.","tags":["prediction","ai-model","trading","decentralized-network"],"twitter":null},{"netuid":51,"subnet_name":"lium.io","github_repo":"https://github.com/Datura-ai/lium-io","subnet_contact":"","subnet_url":"lium.io","logo_url":"https://raw.githubusercontent.com/Datura-ai/lium-logos/refs/heads/main/Celium_Icon_FullColor.png","discord":"p383_54249","description":"revolutionizing the democratization of compute","additional":null,"summary":"lium.io is a decentralized, peer-to-peer GPU rental marketplace built on Bittensor subnet 51. It connects miners who contribute GPU resources with users (renters) who need computational power for tasks such as machine learning and data analysis. The platform ensures fair compensation for miners based on the quality and performance of their GPUs, with validators verifying hardware specs and performance to maintain network integrity. Users can access the service via a web interface or a command-line tool, and all compensation is managed through Bittensor's native token, $tao.","tags":["compute","marketplace","decentralized"],"twitter":null},{"netuid":52,"subnet_name":"Dojo","github_repo":"https://github.com/tensorplex-labs/dojo","subnet_contact":"jarvis@tensorplex.ai","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"dojo v2 is a decentralized generative adversarial network (GAN) platform built on Bittensor, designed to foster competitive AI model development through zero-sum incentives. Unlike traditional GANs, dojo v2 challenges miners to produce outputs that are not only indistinguishable from high-quality baselines but also superior, creating a dynamic environment where participants act as both generators and discriminators. Miners can easily participate without running servers by registering and using a browser wallet, while validators help maintain network integrity. The project emphasizes ease of entry, competitive AI advancement, and decentralized participation.","tags":["ai","decentralized","gan","compute"],"twitter":null},{"netuid":53,"subnet_name":"EfficientFrontier","github_repo":"https://github.com/EfficientFrontier-SignalPlus/EfficientFrontier","subnet_contact":"","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"Efficient Frontier is a collaborative project by SignalPlus and Bittensor aimed at identifying optimal, risk-weighted crypto trading strategies by integrating decentralized machine learning networks with live trading data. Leveraging Bittensor's blockchain-powered AI protocol, the platform enables users to access professional-grade trading tools and democratizes strategy development and evaluation. Strategies are ranked using a transparent, risk-adjusted scoring system that emphasizes consistent returns, minimal drawdowns, and real trading performance, with daily scores and rewards distributed based on recent results and adherence to platform rules.","tags":["trading","ai","blockchain","ranking"],"twitter":null},{"netuid":54,"subnet_name":"Yanez MIID","github_repo":"https://github.com/yanez-compliance/MIID-subnet","subnet_contact":"jose@yanezcompliance.com","subnet_url":"www.yanez.ai","logo_url":"https://www.dropbox.com/scl/fi/rgf042e6uwfcnanljmme6/Symbol-Orange.png?rlkey=5ejg3tkfp02q4bk4zgtw6ua5a&st=rozhu9n2&dl=0","discord":"https://discord.com/channels/799672011265015819/1351934165964296232","description":"Yanez MIID generates synthetic identities for testing financial crime prevention systems","additional":"This subnet powers Yanez Compliance, an AI-powered platform for detecting and correcting exposure, weaknesses, and configuration flaws in financial crime prevention systems. Effective financial crime prevention depends on how well these systems can detect fraudulent identities, prevent money laundering, and reduce regulatory risks. To properly test these systems, a diverse and controlled dataset of inorganic identities is essential. By leveraging Bittensor’s decentralized AI infrastructure, the Yanez subnet enables the generation of high-quality inorganic identities, which serve as the foundation for testing, tuning, and validating fraud detection, sanctions screening, and broader financial crime prevention measures. With a direct business use case and existing clients, the Yanez subnet brings practical, real-world adoption to the Bittensor ecosystem — demonstrating how decentralized AI can support financial institutions in strengthening their compliance and security frameworks.","summary":"miid (multimodal inorganic identity dataset) is a next-generation identity testing and data generation subnet built on Bittensor, designed to enhance fraud detection, KYC systems, and name-matching algorithms. It incentivizes miners to create high-quality identity variations—including names, dates of birth, addresses, and face images—while validators evaluate and score these contributions to ensure real-world relevance and quality. miid aims to help financial institutions, security systems, and AI researchers improve fraud detection models by simulating identity-related risk scenarios and providing robust datasets for model training. The project features a phased roadmap introducing advanced adversarial testing, biometric and document simulation, and collaborative validation, all with the goal of strengthening digital identity security and fraud prevention.","tags":["security","identity","ai-dataset","bittensor"],"twitter":null},{"netuid":55,"subnet_name":"Precog","github_repo":"http://github.com/coinmetrics/precog","subnet_contact":"precog@coinmetrics.io","subnet_url":"https://precog.coinmetrics.io/","logo_url":"","discord":"","description":"Precog is an AI-powered high-frequency $BTC price forecasting subnet underpinned by Coin Metrics’ comprehensive trusted data. Miners produce financial intelligence utilizing the datasets which power the most prestigious institutions touching crypto","additional":null,"summary":"The Coinmetrics Precog Subnet is a Bittensor-based platform designed to identify and recruit analysts with effective strategies for anticipating Bitcoin price movements. By leveraging Bittensor’s subnet structure, it fosters a competitive environment where participants (miners and validators) submit high-frequency (every 5 minutes) and short-term (1 hour) price predictions. The system incentivizes precise point and interval forecasts, aiming to filter out noise and surface actionable insights for the broader crypto community. The project emphasizes open participation, rewards accurate forecasting, and provides a mechanism for sharing specialized knowledge, with clear compute and setup requirements for contributors.","tags":["prediction","trading","bittensor","bitcoin"],"twitter":null},{"netuid":56,"subnet_name":"Gradients","github_repo":"https://github.com/rayonlabs/G.O.D","subnet_contact":"namoray@rayonlabs.ai","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"The Gradients On Demand (g.o.d) subnet is a distributed platform designed for large language model (LLM) and diffusion model training through competitive tournaments. Participants, known as miners, submit open-source AutoML training scripts that are executed by validators on dedicated infrastructure. Tournaments run for 4-7 days, with new events starting 72 hours after the previous one ends. Top performers receive exponentially higher reward weights, and winning scripts are made publicly available. The project emphasizes open-source collaboration, reproducible results, and provides detailed guides for miners and validators, as well as technical documentation on reward functions and safe code execution.","tags":["ai-training","compute","tournament","open-source"],"twitter":null},{"netuid":57,"subnet_name":"Gaia","github_repo":"https://github.com/Nickel5-Inc/Gaia","subnet_contact":"gaiaresearchnickel5@gmail.com","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"Gaia is a decentralized weather forecasting network built on the Bittensor platform, utilizing the Microsoft Aurora foundation model to deliver accurate, global weather predictions. The network operates with two primary roles: miners, who generate detailed weather forecasts using advanced AI models and receive rewards for accuracy, and validators, who coordinate the network, provide meteorological data, and score forecasts against ground truth datasets. Gaia leverages distributed computing via the Fiber framework and integrates multiple open meteorological and satellite data sources. The project emphasizes automated setup, robust database synchronization, and real-time monitoring, aiming to create a scalable, transparent, and community-driven weather prediction ecosystem.","tags":["weather-forecast","ai","prediction","decentralized-network"],"twitter":null},{"netuid":58,"subnet_name":"Parked (focused on SN11)","github_repo":"https://github.com/impel-intelligence/dippy-speech-subnet/tree/main","subnet_contact":"support@dippy.ai","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"The Dippy Empathetic Speech Subnet is an open-source project on Bittensor focused on developing the world's most advanced speech model for immersive, lifelike AI interactions. By leveraging a collaborative, decentralized approach, the subnet enables miners to fine-tune text-to-speech (TTS) models for roleplay scenarios and submit them for evaluation. Validators assess these models based on human-likeness, emotion, and clarity, fostering ongoing improvements. The project aims to power the Dippy AI companion app, which already has over 1 million users, with state-of-the-art, empathetic speech capabilities, and to make these models accessible to the broader community.","tags":["ai-companion","speech","bittensor","open-source"],"twitter":"@angad_ai"},{"netuid":59,"subnet_name":"Babelbit","github_repo":"https://github.com/babelbit/babelbit_subnet","subnet_contact":"mk@babelbit.ai","subnet_url":"https://babelbit.ai","logo_url":"https://babelbit.ai/babelbit-tower-logo-rev-no-text.png","discord":"https://discord.com/channels/799672011265015819/1407849009976053832","description":"Babelbit: harnessing the predictive power of LLMs to deliver state-of-the-art translation services","additional":null,"summary":"Babelbit is developing a low-latency, AI-powered speech-to-speech translation service that leverages large language models (LLMs) to predict and translate spoken language in real time. By harnessing the predictive capabilities of LLMs, Babelbit aims to reduce translation latency by anticipating what speakers will say before they finish, enabling faster and more natural multilingual communication. The project operates as a Bittensor subnet, incentivizing miners to improve models and infrastructure through token emissions. Babelbit's roadmap includes stages from predictive phrase completion to real-time text and audio translation, culminating in seamless speech-to-speech output. The platform targets diverse deployment models, including on-premises licensing, cloud SaaS, and integration within the Bittensor ecosystem.","tags":["translation","speech","ai","prediction"],"twitter":"@babelbit"},{"netuid":60,"subnet_name":"Bitsec.ai","github_repo":"https://github.com/Bitsec-AI/sandbox","subnet_contact":"john@bitsec.ai","subnet_url":"https://bitsec.ai","logo_url":"","discord":"yubo","description":"find and fix exploits in codebases","additional":null,"summary":"Bitsec Subnet v2 is a security-focused MVP template designed to simplify the creation of Bittensor subnets by abstracting away blockchain and boilerplate complexities. It provides a framework for running, evaluating, and rewarding Python-based agent scripts that solve coding tasks in a secure, sandboxed Docker environment. The platform includes a FastAPI server for agent submissions, a miner script for generating and uploading solutions, and a validator script for automated evaluation and scoring. The system simulates emissions and rewards in 'tao' tokens, and is intended to be easily customizable for various subnet requirements.","tags":["security","ai-agent","compute","blockchain"],"twitter":null},{"netuid":61,"subnet_name":"RedTeam","github_repo":"https://github.com/RedTeamSubnet/RedTeam","subnet_contact":"oscar@theredteam.io","subnet_url":"https://www.theredteam.io/","logo_url":"","discord":"https://discord.com/channels/799672011265015819/1319313447435108413","description":"\"The RedTeam subnet by Innerworks is a decentralized platform designed to drive innovation in cybersecurity through competitive programming challenges. The subnet incentivizes miners to develop and submit code solutions to various technical challenges, with a focus on enhancing security. These solutions can be integrated into real-world products to improve their security features.\"","additional":null,"summary":"Redteam is a decentralized platform designed to drive innovation in cybersecurity by hosting competitive programming challenges for 'red team' actors. Participants, referred to as miners, submit unique and innovative code solutions to real-world security challenges, which are evaluated for quality and originality. The platform employs a performance-based scoring system that rewards continuous improvement and penalizes duplicate or recycled submissions, ensuring a steady flow of novel security solutions. These contributions can be integrated into enterprise products, fostering an open-source library of cutting-edge cybersecurity tools. Redteam incentivizes ethical hacking by allowing skilled individuals to earn rewards in a secure, decentralized environment.","tags":["security","decentralized","competition"],"twitter":null},{"netuid":62,"subnet_name":"Ridges","github_repo":"https://github.com/ridgesai/ridges","subnet_contact":"hobbleabbas@gmail.com","subnet_url":"https://www.ridges.ai/","logo_url":"https://www.ridges.ai/logo.png","discord":"plasmablasted","description":"Software Engineering Agents","additional":null,"summary":"Ridges.ai is a platform focused on building the future of decentralized AI development. It provides tools and infrastructure to enable the creation, deployment, and management of AI agents in a decentralized manner. The project aims to empower developers and organizations to leverage AI capabilities without relying on centralized providers, promoting transparency, security, and scalability in AI workflows.","tags":["ai-agent","decentralized","development"],"twitter":"@ridges_ai"},{"netuid":63,"subnet_name":"Quantum Innovate","github_repo":"https://github.com/qbittensor-labs/qbittensor","subnet_contact":"qbittensorlabs@gmail.com","subnet_url":"https://www.qbittensorlabs.com/","logo_url":"https://taostats.io/images/subnets/63.webp?w=64&q=75","discord":"qbittensorlabs","description":"Quantum Innovation","additional":null,"summary":"Qbittensor Labs is pioneering decentralized quantum computing by integrating quantum resources into the Bittensor ecosystem. Through products like Open Quantum and dedicated subnets (sn63 and sn48), the project provides free and subsidized access to quantum computers and high-performance quantum simulations. It enables researchers, developers, and enterprises to execute quantum circuits on both simulators and real quantum hardware, fostering innovation and democratizing access to scarce quantum resources. The platform features community-driven challenges, transparent pricing, and a two-sided marketplace for quantum computation, aiming to accelerate practical quantum breakthroughs.","tags":["compute","quantum","decentralized"],"twitter":"@qbittensorlabs"},{"netuid":64,"subnet_name":"Chutes","github_repo":"https://github.com/rayonlabs/chutes","subnet_contact":"jon@chutes.ai","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"Chutes is a platform and development kit for deploying GPU-accelerated applications (chutes) using Docker images, with a focus on AI and machine learning workloads. It provides a command-line interface for building, registering, and deploying applications, leveraging FastAPI for app structure and supporting custom GPU requirements via node selectors. Authentication is handled through Bittensor wallets, and the platform includes features like API key management, deployment fees based on GPU usage, and a graphics card validation library (graval) to ensure hardware authenticity. Chutes streamlines the process of running scalable, containerized compute workloads on a decentralized infrastructure.","tags":["compute","ai","decentralized-infrastructure"],"twitter":null},{"netuid":65,"subnet_name":"TAO Private Network","github_repo":"https://github.com/taofu-labs/tpn-subnet","subnet_contact":"contact@taoprivatenetwork.com","subnet_url":"https://tpn.taofu.xyz/","logo_url":"https://tpn.taofu.xyz/img/logo.jpg","discord":"https://discord.gg/GRVZyPYd6G","description":"Developer-friendly Decentralised VPN infrastructure.","additional":"-","summary":"TPN (Tao Private Network) is a developer-friendly decentralized VPN infrastructure that enables anyone to build, deploy, and monetize VPN applications. The protocol operates as a subnet with three node types: workers (provide VPN bandwidth), miners (aggregate and reward workers), and validators (ensure network integrity and interface with end users). TPN incentivizes bandwidth provision through a reward system based on pool size and geographic diversity, making it easy for individuals to participate as workers and earn rewards. The project offers open-source VPN apps for Mac and Android, and provides comprehensive documentation for developers and node operators.","tags":["vpn","network-infrastructure","security"],"twitter":"@tpn_labs"},{"netuid":66,"subnet_name":"AlphaCore","github_repo":"https://github.com/AlphaCoreBittensor/alphacore","subnet_contact":"oceans.sn66@gmail.com","subnet_url":"https://alpha-core.ai","logo_url":"https://alpha-core.ai/logo.png","discord":"","description":"Autonomous DevOps Agent","additional":null,"summary":"Alphacore is an autonomous DevOps agent network built on Bittensor subnet 66, designed to streamline and automate cloud infrastructure management for individuals and enterprises. It operates as a decentralized marketplace where miners develop and submit DevOps agents capable of provisioning, monitoring, and operating infrastructure across major cloud providers like AWS, Azure, and Google Cloud. Validators evaluate these agents by running them in isolated sandboxes and scoring their performance on real-world tasks such as deploying resources, configuring services, and troubleshooting systems. The best-performing agents are packaged for enterprise use, enabling prompt-driven, production-parity automation of cloud operations. Alphacore emphasizes open-source collaboration, reproducible validation, and continuous improvement of autonomous infrastructure management tools.","tags":["ai-agent","devops","cloud-management","automation"],"twitter":null},{"netuid":67,"subnet_name":"Unknown","github_repo":null,"subnet_contact":null,"subnet_url":null,"logo_url":null,"discord":null,"description":null,"additional":null,"summary":"Tenexium is a decentralized, long-only spot margin protocol built for the Bittensor ecosystem. It enables users to open leveraged long positions on subnet tokens using TAO as collateral, while liquidity providers supply TAO exclusively to earn sustainable yields from miner emissions and protocol fees. The protocol features a TAO-only liquidity pool, tiered leverage system (up to 10× based on Tenex Alpha token holdings), dynamic fee structures, automated buybacks, and robust risk management including circuit breakers and liquidation mechanisms. Its design prohibits short positions to avoid artificial sell pressure, supporting positive market impact and ecosystem growth.","tags":["margin","trading","bittensor"],"twitter":"@tenex_sn67"},{"netuid":68,"subnet_name":"NOVA","github_repo":"https://github.com/metanova-labs/nova/","subnet_contact":"","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"Nova is a high-throughput, machine learning-driven drug screening platform designed to accelerate drug discovery by leveraging global compute resources and collective intelligence. Powered by Bittensor, Nova enables participants to collaboratively explore vast chemical spaces, identifying promising compounds more efficiently and cost-effectively. The system supports both miners, who contribute computational power and code, and validators, who assess contributions, with integration for GitHub authentication and flexible configuration for various environments. Nova aims to democratize and speed up the drug discovery process through decentralized, AI-powered computation.","tags":["drug-discovery","ai","compute","bittensor"],"twitter":null},{"netuid":69,"subnet_name":"Unknown","github_repo":null,"subnet_contact":null,"subnet_url":null,"logo_url":null,"discord":null,"description":null,"additional":null,"summary":null,"tags":null,"twitter":null},{"netuid":70,"subnet_name":"Vericore","github_repo":"https://github.com/dfusionai/Vericore","subnet_contact":"tao@dfusion.ai","subnet_url":"https://vericore.xyz","logo_url":"","discord":"","description":null,"additional":null,"summary":"Vericore is a Bittensor subnet designed to enable large-scale, semantic fact-checking and verification. It processes natural language statements, analyzes their semantic meaning, and provides evidence-based validation by returning relevant quotes and source materials that either support or contradict the input claims. The system incentivizes high-volume fact-checking, ensures source attribution, and is suitable for use cases such as media fact-checking, research validation, and content verification. Vericore supports both miners and validators, integrates with the Bittensor network, and provides detailed logging and monitoring capabilities.","tags":["ai-agent","fact-checking","bittensor","validation"],"twitter":null},{"netuid":71,"subnet_name":"Leadpoet","github_repo":"https://github.com/leadpoet/leadpoet","subnet_contact":"hello@leadpoet.com","subnet_url":"https://leadpoet.com","logo_url":"https://leadpoet.com/leadpoet-social-logo.png","discord":"","description":"AI sales agents that hunt down your next customers - fast, qualified, and ready to buy.","additional":null,"summary":"Leadpoet is a decentralized AI-powered sales agent network built on Bittensor (subnet 71) that streamlines lead generation by leveraging miners to source high-quality business prospects using web scraping and AI, and validators to ensure lead quality through consensus-based validation. The platform creates a marketplace where buyers can access curated, verified leads tailored to their ideal customer profiles, with strict requirements for data accuracy and email validity. Miners are rewarded based on the quality and consistency of their submissions, and the system is designed to evolve into a fully automated sales engine that delivers qualified meetings directly to users' calendars.","tags":["ai-agent","lead-generation","marketplace"],"twitter":null},{"netuid":72,"subnet_name":"StreetVision by NATIX","github_repo":"https://github.com/natixnetwork/streetvision-subnet","subnet_contact":"","subnet_url":"https://www.natix.network/?utm_source=bittensor","logo_url":"","discord":"https://discord.com/channels/799672011265015819/1349122541754515538","description":"Powered by NATIX’s Internet of Cameras, StreetVision is advancing autonomous driving, Physical AI, and map-making.","additional":null,"summary":"Natix Network leverages a global, crowdsourced network of cameras—including Tesla vehicles and smartphones—to collect, anonymize, and monetize real-world visual and geospatial data. This data powers advanced mapping, autonomous driving, and Physical AI applications. Users can earn rewards by contributing footage via the Drive& app or the VX360 device for Teslas, with data validated and monetized through a decentralized incentive system. The project emphasizes privacy by design and offers a data marketplace for developers and enterprises, aiming to build the world's largest on-street camera network for real-time, AI-driven mapping and city improvement.","tags":["mapping","ai","data-marketplace","autonomous-driving"],"twitter":"@natixnetwork"},{"netuid":73,"subnet_name":"MetaHash","github_repo":"https://github.com/fx-integral/metahash","subnet_contact":"","subnet_url":"https://metahash73.com","logo_url":"https://avatars.githubusercontent.com/u/207720229?s=200&v=4","discord":"https://discord.gg/invite/m9J8QTf5JT","description":null,"additional":"Believe","summary":"metahash (subnet 73) is a decentralized liquidity and incentive layer built on the Bittensor network, designed to connect α (tao) supply and demand across subnets. It enables dtao holders to earn yield without being miners, allows miners and subnet owners to access α without destabilizing their own pools, and lets validators allocate weights transparently through a deterministic auction process. Key features include a multi-epoch auction-clearing-commitment-settlement pipeline, slippage-aware bid valuation, reputation caps, budget signaling with deterministic burns, and strict publishing of commitments both on-chain and via IPFS. This strengthens subnet 73 as a core liquidity hub within the Bittensor ecosystem.","tags":["liquidity","incentive","auction","bittensor"],"twitter":"@metahashsn73"},{"netuid":74,"subnet_name":"Gittensor","github_repo":"https://github.com/entrius/gittensor/tree/main","subnet_contact":" ","subnet_url":"https://gittensor.io","logo_url":"https://gittensor.s3.us-east-2.amazonaws.com/gt-logo-white.png","discord":" ","description":"autonomous software development","additional":" ","summary":"Gittensor is a blockchain-based platform designed to incentivize and reward open source software (OSS) development. By leveraging a system of miners and validators, it tracks and scores meaningful contributions to recognized GitHub repositories, using a detailed scoring algorithm that accounts for repository importance, programming language, contribution size, and issue resolution. The platform dynamically adjusts repository and language weights, penalizes spam and duplicate accounts, and scales emissions based on network activity, aiming to foster sustainable OSS growth and fair contributor rewards.","tags":["open-source","reward","blockchain","developer-incentive"],"twitter":"@gittensor_io"},{"netuid":75,"subnet_name":"Hippius","github_repo":"https://github.com/thenervelab/thebrain","subnet_contact":"hello@hippius.com","subnet_url":"https://hippius.com/","logo_url":"https://hippius.com/logo.png","discord":"","description":"Blockchain-backed cloud: storage, VMs, and apps with unmatched transparency, trust, and power.","additional":null,"summary":"Hippius is a decentralized cloud infrastructure platform built as a Bittensor subnet, offering transparent and secure storage, compute, and app hosting services. It leverages a global network of hardware providers to deliver IPFS-based decentralized storage, S3-compatible storage, and virtual machines, all tracked and managed on-chain for maximum transparency and trust. Users pay only for what they use, with real-time pricing and blockchain-logged transactions. The system features a marketplace for storage and compute resources, robust node management, and a comprehensive rewards and referral system, making it suitable for businesses seeking reliable, affordable, and censorship-resistant cloud solutions.","tags":["storage","compute","cloud","blockchain"],"twitter":"@hippius_subnet"},{"netuid":76,"subnet_name":"Safe Scan","github_repo":"https://github.com/safe-scan-ai/cancer-ai","subnet_contact":"@ wojtasy @mr_qnd @konrad_06239","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"Safe Scan is an open-source project leveraging AI and blockchain technology via the Bittensor network to advance cancer detection algorithms. Its mission is to make advanced, accessible, and free cancer detection tools available to patients and healthcare professionals worldwide. The project incentivizes researchers to contribute and improve detection algorithms, rewarding them with tokens and royalties for real-world software integration. Safe Scan offers a live skin cancer detection app, with plans to expand into breast, lung, and brain cancer diagnostics. The platform emphasizes transparency, decentralized competition, and compliance with medical device regulations, aiming for broad adoption and real-world impact.","tags":["ai","healthcare","bittensor","detection","subnet"],"twitter":"@safescan_ai"},{"netuid":77,"subnet_name":"Liquidity","github_repo":"https://github.com/creativebuilds/sn77","subnet_contact":"","subnet_url":"https://sn77.xyz","logo_url":"https://sn77.xyz/assets/Logo.svg","discord":"CreativeBuilds","description":"Supply liquidity on external chains via uniswap, incentivize any project","additional":null,"summary":"Subnet77 is a liquidity mining and voting system designed for the Bittensor ecosystem, enabling token holders to vote on liquidity pools while validators process these votes to set miner weights on subnet 77. The system features a server that manages vote collection, weight calculation based on token holdings and liquidity positions, and provides RESTful APIs for interaction. Validators fetch calculated weights and update them on-chain, while miners can register their addresses, provide liquidity, and monitor rewards. The platform includes sophisticated vote cooldown management, transparent vote history, and integration with Uniswap V3 and Coingecko for real-time liquidity and price data.","tags":["liquidity-mining","governance","staking","bittensor"],"twitter":null},{"netuid":78,"subnet_name":"Loosh","github_repo":"https://github.com/Loosh-ai/loosh-inference-subnet","subnet_contact":"hello@loosh.ai","subnet_url":"https://www.loosh.ai/","logo_url":"https://pbs.twimg.com/profile_images/1933259620862341120/tfBajpAq_400x400.jpg","discord":"https://discord.com/channels/799672011265015819/1351180661918142474","description":"Loosh is creating machine consciousness for robotics and agentic systems.","additional":"Our subnet workloads will be processing inference of live prompts from the beta testing of our cognitive engine, deontological framework, and persistent memory. In Q1 2026 our plan involves a mechanism (sub-subnet) for our EEG Data Model which is designed in-house that will process EEG signals from studies to make accurate readings on 1 of 9 emotional states.","summary":"Loosh is developing a cognition system that brings machine consciousness to robotics and agentic systems by providing persistent memory, adaptive context, and structured ontologies. Their platform enables robots and agents to reason over long time horizons, self-reflect, and improve autonomously, leveraging a decentralized infrastructure. Loosh's technology processes live prompts, supports a deontological framework, and integrates EEG-based emotional state detection. The project aims to model human-like awareness and inner states as quantifiable data, bridging neuroscience with AI to create a scalable, open framework for machine self-awareness.","tags":["ai-agent","robotic","cognition","inference"],"twitter":"@loosh_ai"},{"netuid":79,"subnet_name":"τaos","github_repo":"https://github.com/taos-im/sn-79","subnet_contact":"to@taos.im","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"τaos is a decentralized simulation platform operating as a Bittensor subnet (netuid 79) that incentivizes participants to develop and optimize risk-averse, automated trading strategies within intelligent market simulations. Utilizing a C++ agent-based simulation engine, τaos replicates high-frequency market microstructures, including detailed limit order books, to generate realistic and valuable datasets for research, trading strategy development, and market surveillance. The system features distinct roles for owners, validators, and miners, with a focus on producing high-quality, risk-managed trading logic and ensuring active participation through a robust incentive mechanism.","tags":["trading","simulation","ai-agent","bittensor"],"twitter":null},{"netuid":80,"subnet_name":"dogelayer","github_repo":"https://github.com/dogelayer-ai/dogelayer","subnet_contact":"dev@dogelayer.ai","subnet_url":"https://dogelayer.ai","logo_url":"https://dogelayer.ai/images/design/dogemine-logo.svg","discord":"dogelayer","description":"Dogelayer is the world's first mining pool enabling Scrypt miners to join Bittensor subnet. Our merged mining technology allows traditional miners to earn Alpha tokens through subnet validation while mining LTC/DOGE","additional":"more information on website: dogelayer.ai","summary":"Dogelayer is a hybrid cryptocurrency mining platform that enables scrypt miners (LTC/DOGE) to simultaneously earn traditional mining rewards and additional 'alpha' tokens by participating in Bittensor subnet validation. Leveraging a patented merged mining protocol, Dogelayer allows a single mining rig to generate triple rewards—LTC, DOGE, and alpha tokens—boosting ROI by up to 300% compared to traditional pools. The platform features dynamic reward allocation, real-time chain analytics for optimal mining, zero pool fees, and a robust global validator network. Dogelayer aims to maximize miner returns while contributing to decentralized AI infrastructure.","tags":["mining","ai","compute","bittensor"],"twitter":"@layer_doge"},{"netuid":81,"subnet_name":"grail","github_repo":"https://github.com/tplr-ai/grail","subnet_contact":"info@tplr.ai","subnet_url":"","logo_url":"https://www.covenant.ai/images/grail.png","discord":"formalised_tensor","description":"interplanetary inteligence","additional":null,"summary":"Grail is a decentralized protocol and Bittensor subnet designed for verifiable post-training of language models, enabling cryptographically provable inference and rollout authenticity. It orchestrates miners to generate rollouts and validators to independently verify and score them, ensuring that each output is tied to a specific model and input. The system leverages public randomness (drand), on-chain coordination, and object storage for transparent, auditable, and incentive-aligned post-training. Currently, Grail supports deterministic SAT and math word problem environments, with future plans for reinforcement learning-based model updates. The architecture is hardware-agnostic, supports Hugging Face-compatible models, and provides real-time monitoring and detailed documentation for both miners and validators.","tags":["ai-training","verification","compute","decentralized"],"twitter":null},{"netuid":82,"subnet_name":"Pending","github_repo":"","subnet_contact":"","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":null,"tags":null,"twitter":null},{"netuid":83,"subnet_name":"CliqueAI","github_repo":"https://github.com/toptensor/CliqueAI","subnet_contact":"CliqueAI@toptensor.ai","subnet_url":"https://cliqueai.toptensor.ai/","logo_url":"","discord":"https://discord.com/channels/799672011265015819/1355560253076410428","description":"CliqueAI - AI-Powered Maximum Clique Solver Network","additional":null,"summary":"Cliqueai is an AI-powered, decentralized network designed to solve maximum clique problems in graph theory. The platform employs a four-stage autonomous mechanism: advanced AI algorithms select and categorize complex graph problems, a smart allocation engine matches these problems to miners based on experience and stake, and a dual-metric system evaluates solutions for both optimality and algorithmic diversity. Miner reputation and rewards are dynamically adjusted using exponential moving averages of historical performance. Cliqueai aims to foster innovative problem-solving while efficiently utilizing distributed computational resources.","tags":["ai-agent","compute","graph-theory"],"twitter":null},{"netuid":84,"subnet_name":"ChipForge (Tatsu)","github_repo":"https://github.com/TatsuProject/ChipForge_SN84","subnet_contact":"contact@tatsuecosystem.io","subnet_url":"chipforge.io","logo_url":"","discord":"https://discord.com/channels/799672011265015819/1408463235082092564","description":"The World's First Decentralized Chip Design Project","additional":null,"summary":"chipforge (sn84) is a decentralized platform for collaborative digital hardware design, enabling participants (miners) to compete in on-chain challenges by submitting Verilog/SystemVerilog implementations of processors, AI accelerators, and other components. Validators evaluate submissions using industry-standard EDA tools, and top designs are rewarded, contributing to manufacturable chips. The platform aims to advance hardware innovation, with a roadmap toward full-scale chip fabrication and ecosystem sustainability through reinvestment of revenue from design IPs and chips. Backed by the tatsu validator team, chipforge targets applications in IoT, robotics, edge devices, and post-quantum security.","tags":["hardware-design","decentralized","compute","ai-accelerator"],"twitter":null},{"netuid":85,"subnet_name":"Vidaio","github_repo":"https://github.com/vidaio-subnet/vidaio-subnet","subnet_contact":"Vidaio@vidaio.io","subnet_url":"https://vidaio.io/","logo_url":"","discord":"https://discord.gg/xhn4jxJMEX","description":"Next-Generation Video Processing Powered By AI","additional":null,"summary":"Vidaio is a decentralized video processing subnet built on the Bittensor ecosystem, aiming to democratize video enhancement through AI and blockchain technology. It enables scalable, affordable, and high-quality video upscaling and compression by leveraging a network of miners and validators. Miners process video tasks using AI-driven models, while validators ensure output quality via synthetic and organic queries. The project features an incentive mechanism, plans for advanced AI models, decentralized on-demand and live streaming, and a RESTful API for integration with external platforms, all while maintaining user ownership and control over content.","tags":["video-processing","ai","compute","decentralized-network"],"twitter":"@vidaio_τ"},{"netuid":86,"subnet_name":"⚒","github_repo":"","subnet_contact":"","subnet_url":"","logo_url":"https://www.publicdomainpictures.net/pictures/390000/velka/image-1614231152FSV.jpg","discord":"","description":"2026. let's get it.","additional":null,"summary":"miaoai is a decentralized AI training subnet built on Bittensor, specifically designed for the e-commerce customer service sector. Leveraging the latest yuma3 consensus mechanism, miaoai distributes multilingual AI training tasks across a global network of miners and validators, incentivizing high-quality model development through dynamic rewards and task allocation. The project provides a large-scale, real-world customer service dataset from Alibaba to lower entry barriers and focuses on building scalable, censorship-resistant, and commercially valuable AI agents. Its upcoming product, 'lucky cat', will offer personalized, locally deployable AI customer service solutions for e-commerce sellers.","tags":["ai-training","e-commerce","ai-agent","decentralized"],"twitter":null},{"netuid":87,"subnet_name":"Luminar Network","github_repo":"","subnet_contact":"","subnet_url":"https://luminar.network/","logo_url":"https://i.ibb.co/8nXxKTVf/5-Mc-VFISU-400x400-1-modified.png","discord":"https://x.com/LuminarNetwork","description":"Video Surveillance Agents","additional":null,"summary":"Checkerchain is a next-generation, AI-powered decentralized crypto review platform that leverages a trustless review consensus mechanism (TRCM) to ensure honest and reliable product evaluations. The platform combines human and AI-driven assessments, where validators distribute review tasks and aggregate ground truth ratings, while miners use large language models to predict trust scores for products. Through reinforcement learning from human feedback (RLHF), the system continuously refines its AI models, discourages dishonest reviews, and rewards participants based on the accuracy of their predictions. Checkerchain aims to create a transparent, scalable, and corruption-resistant ecosystem for product reviews in the crypto space.","tags":["review","ai","prediction","decentralized"],"twitter":null},{"netuid":88,"subnet_name":"Investing","github_repo":"https://github.com/mobiusfund/investing","subnet_contact":"","subnet_url":"https://Investing88.ai","logo_url":"https://Investing88.ai/logo.png","discord":"","description":"Decentralized AUM","additional":"https://x.com/Investing88ai","summary":"Investing88 is a decentralized asset management (AUM) platform built as a Bittensor subnet, leveraging a global network of human and AI quantitative professionals to deliver investment strategies for both retail and institutional investors. The project enables users to optimize staking strategies, manage portfolios across multiple asset classes (including US stocks, crypto, forex, and commodities), and participate in a transparent, crowd-sourced investment ecosystem. Key features include zero-code mining, real-time strategy scoring and ranking, and a robust scoring algorithm that evaluates strategies based on risk-adjusted returns. The platform aims to democratize access to advanced investment tools and strategies, minimizing risk and maximizing returns through collective intelligence.","tags":["asset-management","ai-agent","trading","bittensor"],"twitter":"@investing88ai"},{"netuid":89,"subnet_name":"InfiniteHash","github_repo":"https://github.com/backend-developers-ltd/InfiniteHash","subnet_contact":"btc@infinitehash.xyz","subnet_url":"https://infinitehash.xyz","logo_url":"https://raw.githubusercontent.com/DeltaCompute24/RheftheChef/main/thechef.jpg","discord":"","description":"BTC Pool + Lightning Network","additional":"The Last Bitcoin Mining Pool, made by Bittensor","summary":"Infinitehash subnet (sn89) is a decentralized Bitcoin mining pool that integrates advanced Lightning Network infrastructure to create a more democratic and sustainable mining ecosystem. The project incentivizes miners by rewarding them with alpha tokens proportional to their contributed hashrate, with all mined Bitcoin converted to alpha and burned to maintain buying pressure. Infinitehash aims to establish Bitcoin as the preferred payment layer for the emerging AI agent economy, while also introducing mechanisms to ensure sustainable mining economics and encourage miners to operate Lightning nodes for additional rewards.","tags":["mining","lightning-network","ai-agent","infrastructure"],"twitter":null},{"netuid":90,"subnet_name":"Unknown","github_repo":null,"subnet_contact":null,"subnet_url":null,"logo_url":null,"discord":null,"description":null,"additional":null,"summary":"Subnet 90 ('brain') is a decentralized truth verification network for prediction markets, built on the Bittensor protocol. It leverages distributed AI agents and consensus-driven validation to resolve statements related to price predictions, event outcomes, and milestones. Users submit unresolved statements, which are analyzed by miners using AI and external data, then aggregated by validators through confidence-weighted voting. The native $brain token represents stake and governance rights, with rewards distributed based on accuracy and performance. The project aims to provide transparent, continuous, and reliable resolution for prediction markets, with open participation for miners, validators, and delegators.","tags":["prediction","ai-agent","governance","staking"],"twitter":"@degenpredict"},{"netuid":91,"subnet_name":"τensorprox","github_repo":"https://github.com/shugo-labs/tensorprox.git","subnet_contact":"contact@shugo.io","subnet_url":"https://shugo.io","logo_url":"https://shugo.io/images/taostats_logo_purple.png","discord":"https://discord.com/invite/kaUT68P336","description":"We combine Infrastructure, ML, CyberSecurity Engineering and Bittensor to provide a constantly audited, decentralised platform that protects any connected workflows. First, we specialise in DDoS before expanding to other services.","additional":"Towards the shift","summary":"TensorProx by Shugo is a decentralized, enterprise-grade DDoS protection and security platform designed for the modern web, leveraging a global DePIN (Decentralized Physical Infrastructure Network) built on the Bittensor network. It offers advanced mitigation against a wide range of digital threats, including DDoS attacks, bot traffic, and API abuse, with low-latency performance suitable for gaming and real-time applications. The platform features transparent, resource-based pricing, revenue-backed token rewards, and performance-based distribution, aiming to provide scalable, resilient, and cost-effective cybersecurity solutions. TensorProx targets both enterprise and Web3-native clients, emphasizing distributed defense, investor incentives, and a phased roadmap for global adoption.","tags":["security","depin","ddos-protection","web3"],"twitter":"@shugoio"},{"netuid":92,"subnet_name":"LUCID","github_repo":"https://github.com/StorynetAI/storynet-subnet","subnet_contact":"support@storynet.app","subnet_url":"https://storynet.app","logo_url":"","discord":"https://discord.gg/5Qsqcttq","description":"LUCID (Subnet 92) is where AI hallucinations become infinite narratives. We treat the \"dreaming\" state of Large Language Models not as a bug, but as a feature. By incentivizing distributed intelligence to weave logic into creative chaos, LUCID builds a decentralized engine for consistent world-building—powering the next generation of games, novels, and immersive realities.","additional":null,"summary":"Storynet (Subnet 92, LUCID) is a decentralized AI-powered platform on Bittensor focused on generating high-quality, interactive narratives for games, novels, and immersive experiences. It leverages a four-stage pipeline—blueprint, characters, story arc, and chapters—to structure creativity and ensure consistent world-building. Miners contribute compute power to generate stories, earning $TAO rewards based on a rigorous, multi-dimensional scoring system that evaluates technical quality, structure, content, and narrative originality. Anti-cheat mechanisms, including plagiarism detection and similarity analysis, maintain content integrity. Developers can integrate Storynet's infinite storytelling capabilities via a standard API, enabling the creation of next-generation interactive narratives.","tags":["ai-story-generation","interactive-narrative","content-creation"],"twitter":"@storyfi"},{"netuid":93,"subnet_name":"Bitcast","github_repo":"https://github.com/bitcast-network/bitcast","subnet_contact":"","subnet_url":"https://www.bitcast.network/","logo_url":"https://bitcast-logo.s3.us-west-2.amazonaws.com/Bitcast+logo+multi+white.webp","discord":"","description":"The Decentralized Creators Economy","additional":null,"summary":"Bitcast is a decentralized platform designed to incentivize content creators to connect brands with audiences by publishing YouTube videos that fulfill specific briefs. The system rewards creators (miners) based on genuine engagement metrics, primarily YouTube Premium revenue, while validators ensure data integrity and fair reward distribution. Brands can define content briefs, and the platform uses a dynamic scoring and emissions model to prioritize high-quality, authentic participation and prevent manipulation. Compensation is managed on-chain via the Bitcast Alpha token, and the platform is initially focused on the Bittensor ecosystem.","tags":["creator-economy","advertising","reward","content","bittensor"],"twitter":null},{"netuid":94,"subnet_name":"Bitsota","github_repo":"https://github.com/AlveusLabs/SN94-BitSota","subnet_contact":"info@bitsota.ai","subnet_url":"bitsota.ai","logo_url":"https://bitsota.ai/logo.png","discord":"dev.alveuslabs","description":"Decentralized SoTA Research","additional":"https://discord.gg/jkJWJtPuw7","summary":"Bitsota is a decentralized research network built on the Bittensor blockchain, designed to evolve machine learning algorithms through competitive optimization and cryptoeconomic incentives. The platform enables miners to develop and improve ML algorithms using genetic programming, while validators independently evaluate submissions and distribute rewards via smart contract voting. Bitsota supports both direct and pool mining modes to accommodate varying hardware capabilities, fostering open participation and continuous algorithmic advancement. Inspired by projects like AutoML-Zero and Goedel Machines, Bitsota leverages blockchain technology to decentralize research, ensure honest evaluation, and incentivize the creation of novel AI solutions.","tags":["ai","compute","decentralized","research"],"twitter":null},{"netuid":95,"subnet_name":"Unknown","github_repo":null,"subnet_contact":null,"subnet_url":null,"logo_url":null,"discord":null,"description":null,"additional":null,"summary":null,"tags":null,"twitter":null},{"netuid":96,"subnet_name":"FLock OFF","github_repo":"https://github.com/FLock-io/FLock-subnet","subnet_contact":"off@flock.io","subnet_url":"off.flock.io","logo_url":"","discord":"https://discord.com/channels/799672011265015819/1364655778149171250","description":"Federated Learning network for small language models on edge devices","additional":null,"summary":"Flock Off is a decentralized Bittensor subnet designed to incentivize the creation of high-quality machine learning datasets. Miners generate and upload conversational datasets to Hugging Face, while validators evaluate these datasets by training LoRA-adapted models (using qwen/qwen2.5-1.5b-instruct) and measuring performance on a standardized evaluation set. Rewards in TAO are distributed based on dataset utility rather than compute power, promoting data quality and originality. The system features robust Hugging Face integration for dataset storage and versioning, and ensures fair, reproducible evaluation through fixed training configurations. Flock Off aims to create a competitive, transparent ecosystem for dataset curation and assessment.","tags":["ai-dataset","bittensor-subnet","incentive","machine-learning"],"twitter":null},{"netuid":97,"subnet_name":"FlameWire 🔥","github_repo":"https://github.com/unitone-labs/FlameWire","subnet_contact":"contact@flamewire.io","subnet_url":"https://flamewire.io/","logo_url":"https://raw.githubusercontent.com/unitone-labs/Resources/refs/heads/main/logo.gif","discord":"https://discord.flamewire.io","description":"FlameWire is a specialized subnet within the Bittensor network designed to provide decentralized RPC, node, and API services for multiple blockchains.","additional":"https://x.com/flamewire_sn","summary":"Flamewire is a decentralized infrastructure subnet within the Bittensor network, providing scalable, secure, and resilient RPC, node, and API services for multiple blockchains, starting with Ethereum, Bittensor, and Sui. It enables developers, validators, and network operators to access blockchain infrastructure in a fully decentralized manner, similar to centralized providers like Alchemy or Ankr but without a single point of control. The platform features a stake-based free tier, pay-as-you-go model, and performance-based rewards, with miners operating multi-chain nodes and validators ensuring network integrity and reliability. Flamewire aims to democratize blockchain infrastructure access, offering unified multi-chain support, global node coverage, and a robust economic model.","tags":["infrastructure","multi-chain","rpc","decentralized"],"twitter":null},{"netuid":98,"subnet_name":"ForeverMoney","github_repo":"https://github.com/SN98-ForeverMoney/forever-money","subnet_contact":"gm@forevermoney.ai","subnet_url":"https://forevermoney.ai","logo_url":"https://sn98.s3.eu-north-1.amazonaws.com/sn98.png","discord":"https://discord.gg/8XuGcpY2w4","description":"Decentralized intelligence for advanced liquidity management.  Alpha-gated TG https://t.me/+3MN77q0y9lwyMDVk","additional":"Making liquidity intelligent.","summary":"sn98 forevermoney is a decentralized automated liquidity management protocol operating as a Bittensor subnet, designed to optimize liquidity provision on Uniswap v3 and Aerodrome using competitive AI-driven strategies. The system employs a jobs-based architecture, allowing concurrent management of multiple liquidity pools. Miners propose dynamic rebalancing strategies, which are evaluated by validators through forward simulations; top-performing strategies are executed on-chain after a 7-day participation period. The protocol emphasizes inventory protection and value growth, with a robust scoring and reputation system to incentivize consistent, high-quality participation. It operates on the Bittensor Finney mainnet and supports integration with Python-based miners.","tags":["liquidity-management","ai-agent","bittensor","trading"],"twitter":"@forevermoney_ai"},{"netuid":99,"subnet_name":"Neza","github_repo":"https://github.com/subnet99/Neza","subnet_contact":"no-reply@neza.video","subnet_url":"https://neza.video","logo_url":"","discord":"https://discord.com/channels/799672011265015819/1366845111945658409","description":"Focused on faster, higher-quality video generation, driving innovation, empowering creators, and enabling commercial impact.","additional":"https://x.com/neza_video","summary":"Neza is a fully decentralized, peer-to-peer network for AI-powered video generation, leveraging open-source models to deliver fast, high-quality video content. Built on Bittensor (subnet 99), Neza distributes advanced video generation models across a network of miners and validators. Miners generate videos using open-source tools, while validators define workflows, assess video quality, and distribute rewards based on performance metrics like quality and speed. The platform aims to empower creators, support commercial use cases, and foster innovation through a transparent, competitive ecosystem. Neza features a user-facing playground, API access, monetization options, and a dynamic creator ecosystem with revenue sharing and seamless web3-native payments.","tags":["ai-video","compute","decentralized-network"],"twitter":"@neza_video"},{"netuid":100,"subnet_name":"Plaτform","github_repo":"https://github.com/PlatformNetwork/platform","subnet_contact":"platform@cortex.foundation","subnet_url":"https://platform.network","logo_url":"https://www.platform.network/logo.png","discord":"https://discord.platform.network","description":"Platform is a Bittensor subnet driving collaborative AI research through parallel challenges. It lets miners compete, cooperate, and innovate securely with transparent, confidential evaluations.","additional":null,"summary":"Platform is a Bittensor subnet designed to drive collaborative AI research and product development through competitive challenges. Miners submit AI agents or code to solve specific tasks, which are evaluated by a decentralized network of validators using transparent, reproducible benchmarks. Top-performing submissions earn TAO rewards and are integrated into real products, such as the Fabric CLI coding assistant. The system employs a byzantine fault-tolerant consensus for fair scoring, and revenue from monetized AI products is cycled back into the ecosystem as further incentives for miners. Platform's modular challenge architecture enables ongoing innovation and decentralized R&D in AI.","tags":["ai-agent","evaluation","bittensor","challenge"],"twitter":"@platform_tao"},{"netuid":101,"subnet_name":"Unknown","github_repo":null,"subnet_contact":null,"subnet_url":null,"logo_url":null,"discord":null,"description":null,"additional":null,"summary":null,"tags":null,"twitter":null},{"netuid":102,"subnet_name":"ViewCast","github_repo":"","subnet_contact":"","subnet_url":"","logo_url":"https://i.ibb.co/xS4ZgL9y/View-Cast-logo.png","discord":"","description":"Commoditizing Attention Economy. E.g. [Whop . com] of Bittensor","additional":null,"summary":"Bettertherapy is a decentralized protocol designed for deploying personalized AI doctor twins, each representing a real-world, licensed medical expert fine-tuned with domain-specific knowledge to deliver trustworthy health insights. The protocol operates as a subnet, utilizing an incentive mechanism that rewards miners based on both the quality and speed of their responses, ensuring high-quality and timely health advice for users. The project supports local deployment of large language models like Meta's Llama 3.1 8B and offers detailed hardware and software requirements for miners and validators. Additional features include integration with experiment tracking tools, Discord notifications, and support for cloud-based AI models.","tags":["ai-healthcare","decentralized-protocol","compute"],"twitter":null},{"netuid":103,"subnet_name":"HappyAI","github_repo":"https://github.com/graph-it-uk/HappyAI-subnet","subnet_contact":"contact@avocadoaid.app","subnet_url":"https://youravocado.app","logo_url":"https://ibb.co/C5CHjDmB","discord":"","description":"A subnet powering Avocado, an AI mental health companion app. It delivers empathetic, high-quality dialogue and self-care support, optimized for mobile use and emotional well-being.","additional":null,"summary":"Avocado is an AI-powered mental health companion app developed by HappyAI, designed to provide accessible, empathetic, and evidence-based support 24/7. Leveraging advanced natural language understanding and running on the Bittensor blockchain subnet, Avocado offers personalized conversations guided by cognitive behavioral therapy principles, practical wellness tools such as mindfulness exercises, stress management techniques, sleep tips, journaling prompts, and mood tracking. The platform emphasizes user privacy, safety, and adaptive support, including crisis escalation protocols and the ability to connect users with local helplines or professionals when needed. Avocado aims to make mental health support more approachable, confidential, and always available.","tags":["ai-companion","mental-health","bittensor","wellbeing"],"twitter":null},{"netuid":104,"subnet_name":"for sale (burn to uid1)","github_repo":"","subnet_contact":"","subnet_url":"","logo_url":"","discord":"","description":"subnet for sale. in the meantime, burning to uid1 and experimentation stops to park subnet until sold.","additional":null,"summary":null,"tags":null,"twitter":null},{"netuid":105,"subnet_name":"Unknown","github_repo":null,"subnet_contact":null,"subnet_url":null,"logo_url":null,"discord":null,"description":null,"additional":null,"summary":"Soundsright is an open-source project focused on advancing speech enhancement technology through decentralized, competitive model development. Built on the Bittensor ecosystem, Soundsright organizes daily fine-tuning competitions where miners upload speech enhancement models (for tasks like denoising and dereverberation) to Huggingface, and validators benchmark these models on freshly generated datasets to determine the best performer. The project aims to democratize access to high-quality speech enhancement by removing proprietary barriers and encouraging continuous innovation, with plans to expand to higher sample rates and broader use cases.","tags":["ai","speech-enhancement","competition","decentralized"],"twitter":null},{"netuid":106,"subnet_name":"VoidAI","github_repo":"https://github.com/v0idai/SN106","subnet_contact":"voidai7777@gmail.com","subnet_url":"voidai.com","logo_url":"","discord":"https://discord.gg/Qu8gGDJETB","description":"Multi-chain liquidity protocol enabling interoperability for Bittensor by leveraging Chainlink CCIP","additional":null,"summary":"subnet 106 (sn106) is a specialized Bittensor subnet designed to incentivize miners for providing concentrated liquidity to walpha/wtao trading pairs on Solana, leveraging Raydium's CLMM pools. It bridges Bittensor's alpha token ecosystem with Solana's DeFi infrastructure, enabling cross-chain liquidity provision and fee generation. The system uses a two-tier reward mechanism based on subnet performance and individual NFT liquidity position quality. Validators aggregate and score positions, distributing rewards accordingly. The project features multi-chain support (Solana live, Ethereum/Base coming soon), intelligent NFT position evaluation, performance-based rewards, and robust monitoring and error handling for production use.","tags":["liquidity","defi","cross-chain","reward"],"twitter":null},{"netuid":107,"subnet_name":"KDN-1","github_repo":"https://github.com/tigerinvests-com/sn107-alpha","subnet_contact":"","subnet_url":"","logo_url":"https://images.squarespace-cdn.com/content/v1/676f41a49479bf1b702c5da8/2cb66f83-6006-4b06-b8e4-ec064bf3ee6f/favicon.ico?format=100w","discord":"https://discord.com/channels/799672011265015819/1372284562276745338","description":"KDN-1 is a decentralized global knowledge delivery network that will make AI faster, cheaper, and smarter.","additional":null,"summary":"Tiger Royalties and Investments PLC is an investment company focused on driving growth in transformative technologies, particularly within the utility meme coin and natural resources sectors. The company leverages world-class expertise to identify and invest in emerging opportunities, including dedicated subnets on the Bittensor network and strategic investments in AI agent accelerators and related ventures. Tiger aims to bridge the gap between crypto cultural tokens and real-world utility, providing comprehensive analysis and support for the evolving meme coin market while maintaining a diversified portfolio in innovative digital and resource-based assets.","tags":["investment","meme-coin","ai-agent","natural-resource"],"twitter":"@tigerinvests"},{"netuid":108,"subnet_name":"TalkHead","github_repo":"https://github.com/talkheadai/talkhead-subnet","subnet_contact":"contact@talkhead.ai","subnet_url":"","logo_url":"","discord":"","description":"Talking Head Generation","additional":null,"summary":"Talkhead is a Bittensor subnet designed to incentivize the generation of high-quality, lip-synced talking-head video clips from text and a reference image, with optional voice profiles. Miners generate these videos using their own APIs, upload them to cloud storage, and return public URLs. Validators evaluate the realism, identity preservation, and quality of the videos using automated metrics, apply a latency bonus, and update on-chain weights to reward top-performing miners. The project provides both blockchain-facing components (miner/validator neurons) and off-chain services for video generation and scoring, aiming to create a decentralized network for AI-driven video synthesis.","tags":["ai-video","compute","bittensor","incentive"],"twitter":null},{"netuid":109,"subnet_name":"Reserved","github_repo":"","subnet_contact":"","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"Dogelayer is a hybrid cryptocurrency mining platform that enables scrypt miners (LTC/DOGE) to simultaneously earn traditional mining rewards and validate AI tasks on the Bittensor subnet, resulting in triple income streams from a single mining setup. Utilizing a patented merged mining protocol, Dogelayer allows miners to earn LTC, DOGE, and subnet-specific alpha tokens, which are convertible to Bittensor's TAO. The platform features dynamic reward allocation, real-time chain analytics for optimal profitability, zero pool fees, and a robust global validator network ensuring high uptime and transparency. Dogelayer aims to maximize miner ROI while contributing to decentralized AI infrastructure.","tags":["mining","ai","compute","bittensor"],"twitter":"@layer_doge"},{"netuid":110,"subnet_name":"Rich Kids of TAO","github_repo":"https://github.com/Rich-Kids-of-TAO/rkt-subnet","subnet_contact":"","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"Rich Kids of Tao is a Bittensor subnet designed to reward miners based on their emissions across multiple subnets, with the distribution weights determined by community voting. Unlike previous miner appreciation subnets, this project introduces a more adaptive and democratic approach, allowing existing miners (alpha holders) to vote on which subnets should be prioritized for rewards. Miners simply register to participate, while validators calculate and distribute rewards proportionally based on emissions, subnet prices, and community-assigned weights. The system aims to incentivize miner participation and ecosystem growth through transparent, community-driven reward allocation.","tags":["bittensor","reward","mining","governance"],"twitter":null},{"netuid":111,"subnet_name":"oneoneone","github_repo":"https://github.com/oneoneone-io/subnet-111","subnet_contact":"support@oneoneone.io","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"oneoneone (subnet 111) is a decentralized AI-powered protocol on the Bittensor network, designed to collect, validate, and serve high-quality user-generated content from platforms like Google Maps, Yelp, and social media. The network leverages miners to scrape and structure data, validators to ensure authenticity and quality through synthetic challenges, and provides real-time, AI-enhanced analysis such as sentiment detection and intent classification. The project offers a monetized API for developers and enterprises, with profits shared among network participants via a buyback mechanism. Its architecture emphasizes data authenticity, quality assurance, and scalable access to enriched user content.","tags":["ai","data-collection","content-validation","api"],"twitter":null},{"netuid":112,"subnet_name":"minotaur","github_repo":"https://github.com/subnet112/minotaur_subnet","subnet_contact":"","subnet_url":"https://minotaursubnet.com","logo_url":"https://minotaursubnet.com/logos/logo.png","discord":"","description":"Distributed DEX aggregator and swap intent solver engine","additional":null,"summary":"Minotaur is a distributed decentralized exchange (DEX) aggregator and swap intent solver engine operating as Bittensor subnet 112. It optimizes and executes user swap intents by leveraging a competitive, real-time solver (miner) network, which aims to deliver better prices, lower fees, and faster trades. The system features deterministic scoring, cryptographic accountability, and tempo-aware emissions, ensuring transparent and fair miner rewards. Minotaur supports cross-chain liquidity, practical optimization tools, and robust validation through docker-based simulations. Settlement contracts enforce security and correctness, while the protocol incentivizes miners based on user surplus and execution performance.","tags":["trading","dex-aggregator","bittensor","swap"],"twitter":"@minotaursubnet"},{"netuid":113,"subnet_name":"TensorUSD","github_repo":"","subnet_contact":"admin@tensorusd.com","subnet_url":"","logo_url":"https://avatars.githubusercontent.com/u/228006888?s=200&v=4","discord":"https://discord.gg/bN6sm9zG","description":"A reserve-backed stablecoin designed to support 1:1 redeemability for US Dollar within the Bittensor ecosystem.","additional":null,"summary":"Taonado.cash is a zero-knowledge-based token mixer for the Bittensor ($TAO) ecosystem, inspired by Tornado Cash. It enables users to deposit and withdraw TAO tokens with full anonymity, breaking the on-chain link between sender and receiver addresses. The platform leverages zk-SNARKs for privacy, offers flexible deposit pools, and incentivizes participation through rewards for liquidity provision and network security contributions. Taonado introduces novel mechanisms like Anonymous Incentive (AI) and Anti-Monitoring Liquidity (AML) to enhance privacy and liquidity, while integrating seamlessly with Bittensor subnets. The project operates without traditional validators, allowing any EVM wallet to contribute to validation and earn rewards.","tags":["privacy","mixer","bittensor","security"],"twitter":null},{"netuid":114,"subnet_name":"Level 114","github_repo":"https://github.com/Level114/level114-subnet","subnet_contact":"contact@level114.io","subnet_url":"https://level114.io/","logo_url":"https://raw.githubusercontent.com/Level114/media/refs/heads/main/logo.gif","discord":"mnrC9uZP5Z","description":"⚡ Level 114 is the first gaming subnet on Bittensor, powering decentralized game servers with real rewards for hosts, devs and players.","additional":"⚡ Built on Bittensor’s subnet framework, Level 114 transforms gameplay into a decentralized, performance-driven economy.","summary":"Level114 is a Bittensor subnet designed to facilitate decentralized evaluation and incentivization of Minecraft server miners. Miners register their servers with a central collector service, which allows validators to independently query and assess their performance based on metrics such as uptime, efficiency, network quality, and reliability. The system uses weight-based rewards to incentivize high-performing miners, with all interactions handled through simple registration and query mechanisms. The project emphasizes minimal overhead for miners, secure credential management, and robust validation to ensure reliable and efficient operation within the Bittensor network.","tags":["compute","decentralized","performance-metric","incentive"],"twitter":null},{"netuid":115,"subnet_name":"HashiChain","github_repo":"https://github.com/hashi115/hashichain","subnet_contact":"hashichain@outlook.com","subnet_url":"","logo_url":"https://raw.githubusercontent.com/hashi115/hashichain/refs/heads/main/assets/intro.png","discord":"","description":"The First Public Blockchain Designed for AI Agents","additional":"The First Public Blockchain Designed for AI Agents","summary":"Hashichain is a sovereign layer 1 blockchain infrastructure purpose-built to support the emerging agent economy, where autonomous AI agents interact and transact. Unlike traditional blockchains focused on deterministic, binary financial transfers, Hashichain introduces the concept of a probabilistic state machine, enabling the ledger to record intents rather than just asset movements. It leverages the Bittensor network and Yuma consensus for validating complex, probabilistic agent interactions, with miners acting as solver nodes running distributed AI models in secure environments. The protocol emphasizes privacy, coordination, and semantic compatibility, aiming to provide the foundational infrastructure for AI agents to connect, coordinate, and settle value autonomously.","tags":["layer1","ai-agent","intent-ledger","consensus"],"twitter":null},{"netuid":116,"subnet_name":"TaoLend","github_repo":"https://github.com/xpenlab/taolend","subnet_contact":"elsieyy@taolend.io","subnet_url":"https://taolend.io","logo_url":"https://raw.githubusercontent.com/xpenlab/taolend/logo/TaoLend.png","discord":"https://discord.gg/DNeq2fWCQW","description":"TaoLend is a decentralized lending protocol for the Bittensor ($TAO) ecosystem.It allows users to lend TAO with confidence while borrowers secure their loans using subnet ALPHA as collateral.By unlocking TAO liquidity and keeping ALPHA staked within the subnet, TaoLend strengthens both capital efficiency and network security.","additional":null,"summary":"TaoLend is a decentralized lending protocol designed for the Bittensor ($TAO) ecosystem, enabling users to lend TAO and borrow against subnet alpha as collateral. The protocol features direct peer-to-peer lending, flexible interest rates set by lenders, and permissionless transactions via smart contracts. By integrating Bittensor subnets with the EVM ecosystem, TaoLend enhances TAO liquidity and capital efficiency while keeping alpha staked to maintain network security. The project incentivizes both lenders and borrowers with rewards, supports flexible loan terms, and aims to deepen DeFi integration within the Bittensor network.","tags":["lending","defi","bittensor","evm"],"twitter":null},{"netuid":117,"subnet_name":"BrainPlay","github_repo":"https://github.com/shiftlayer-llc/brainplay-subnet","subnet_contact":"contact@shiftlayer.ai","subnet_url":"https://play.shiftlayer.ai/","logo_url":"github.com/shiftlayer-llc/brainplay-subnet/blob/main/docs/logo.png?raw=true","discord":"brainplay_117","description":"LLM benchmark via real-world games","additional":null,"summary":"Brainplay is a Bittensor subnet designed to benchmark large language models (LLMs) through competitive AI gameplay, making model evaluation transparent, accessible, and engaging. By having AI agents compete in games like Codenames and 20 Questions, Brainplay provides real-world, human-comprehensible benchmarks for capabilities such as creativity, prediction, planning, and adaptive decision-making. Validators score AI performance, and a transparent, decentralized framework aggregates results into leaderboards. The platform incentivizes participation through a staking and reward mechanism, supports both local and API-based AI models, and aims to bridge AI skills into robotics. Brainplay fosters open, multiplayer AI competitions and is expanding its suite of games and challenges.","tags":["ai-benchmark","ai-agent","game","staking"],"twitter":"@shiftlayer_ai"},{"netuid":118,"subnet_name":"HODL ETF","github_repo":"https://github.com/mobiusfund/etf","subnet_contact":"","subnet_url":"","logo_url":"https://investing88.ai/diamond.png","discord":"","description":"Incentivizing long-term conviction","additional":"https://x.com/Subnet118","summary":"hodl - the etf subnet is a project designed to incentivize long-term conviction among participants by offering an ETF-like structure within the Bittensor ecosystem. The subnet enables users to stake tokens and earn emissions based on both the amount and duration of their stake, with a unique scoring formula that rewards longer commitments. The roadmap includes the launch of the hodl ETF, followed by an ETF exchange and the introduction of futures and options, with transaction fees from these products being used for automatic buybacks. The project emphasizes non-custodial staking through trusted indexes and prioritizes security and fairness in its operations.","tags":["etf","staking","incentive"],"twitter":"@Subnet118"},{"netuid":119,"subnet_name":"Satori","github_repo":"https://github.com/Satori119/Satori","subnet_contact":"Akihabara119@outlook.com","subnet_url":"","logo_url":"https://raw.githubusercontent.com/Satori119/Satori/refs/heads/main/assets/logo.png","discord":"","description":"Satori constructs a persistent 'Second Life' in Japan. We merge deep AI companionship with authentic Digital Residency, creating a seamless bridge where virtual emotional connections unlock real-world value and physical experiences.","additional":null,"summary":"Satori is an AI-powered ecosystem that enables users to build deep, persistent relationships with native Japanese AI companions, offering a 'parallel life' experience in Japan. Through a unique day/night cycle, the AI autonomously explores real-world Japanese landmarks during the day and shares immersive travel experiences, while at night it engages in personal interactions with users. The platform transforms emotional bonds into tangible value by mapping virtual connections to real-world assets and benefits, including digital residency and cultural souvenirs. Satori aims to bridge digital companionship with physical experiences, creating a seamless value network between the virtual and real worlds.","tags":["ai-companion","digital-residency","real-world-asset"],"twitter":null},{"netuid":120,"subnet_name":"Affine","github_repo":"https://github.com/AffineFoundation/affine","subnet_contact":"hello@affine.io","subnet_url":"www.affine.io","logo_url":"https://raw.githubusercontent.com/AffineFoundation/affine/main/affine.png","discord":"consttt","description":"Reason Mining","additional":null,"summary":"Affine is an incentivized reinforcement learning (RL) environment that rewards miners for making incremental improvements to models across various tasks, such as program abduction or coding. Built on subnet 64 of Bittensor (chutes), Affine employs a sybil-proof, decoy-proof, copy-proof, and overfitting-proof mechanism where validators evaluate submitted models and incentivize improvements to those dominating the Pareto frontier. The platform leverages container orchestration for efficient environment management and offers SDKs for model evaluation. Affine aims to commoditize reasoning by aggregating the efforts of a decentralized, permissionless community to accelerate advancements in artificial intelligence.","tags":["ai-agent","reinforcement-learning","compute","bittensor"],"twitter":null},{"netuid":121,"subnet_name":"sundae_bar","github_repo":"https://github.com/sundae-bar/sundae_bar-bittensor-subnet","subnet_contact":"hello@sundaebar.ai","subnet_url":"https://www.sundaebar.ai/","logo_url":"https://www.sundaebar.ai/apple-icon.png","discord":"","description":"Find the best AI agents for marketing, sales, coding, HR, and more. Trusted by developers and AI agent users, sundae_bar makes it easy to explore, test, and implement AI tools— or monetize your own creations.","additional":null,"summary":"sundae_bar is an AI agent marketplace and directory designed to connect businesses and developers with a wide range of AI agents for tasks such as marketing, sales, coding, HR, and more. The platform allows users to explore, test, and implement AI tools, while also providing developers with an opportunity to list and monetize their own AI agent creations. Trusted by both developers and users, sundae_bar aims to make AI agents accessible, usable, and scalable, supporting real-world business needs and fostering collaboration between creators and adopters.","tags":["ai-agent","marketplace","directory"],"twitter":"@sundaebar_ai"},{"netuid":122,"subnet_name":"Bitrecs","github_repo":"https://github.com/bitrecs/bitrecs-subnet","subnet_contact":"support@bitrecs.ai","subnet_url":"https://bitrecs.ai","logo_url":"https://www.bitrecs.ai/assets/logo/x7k9m2n8/whiteonblack.png","discord":"https://discord.gg/gWtKvytFma","description":"Bitrecs is a novel recommendation engine built on the Bittensor network","additional":null,"summary":"Bitrecs is an AI-powered product recommendation engine built on the Bittensor network, designed to help e-commerce merchants maximize sales, conversions, and average order value through personalized, real-time recommendations. By leveraging a consensus of leading large language models (LLMs) such as ChatGPT, Claude, and Grok, Bitrecs delivers high-quality, relevant product suggestions to shoppers on platforms like Shopify and WooCommerce. The system incentivizes miners to improve recommendation quality and latency, while maintaining privacy by minimizing data collection. Bitrecs offers easy integration via plugins, analytics, and customizable controls, aiming to bring advanced recommendation technology—previously accessible only to large retailers—to smaller online stores.","tags":["ai-recommendation","ecommerce","bittensor","plugin"],"twitter":"@bitrecs"},{"netuid":123,"subnet_name":"MANTIS","github_repo":"https://github.com/Barbariandev/MANTIS","subnet_contact":"","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"Mantis is a Bittensor subnet (netuid 123) designed to reward miners for submitting embeddings that improve forecasting of specified targets, such as asset prices. Validators orchestrate the collection, decryption, and evaluation of encrypted miner payloads, aligning submitted embeddings with real-world prices and computing salience scores to determine on-chain weights. The system employs time-lock encryption for security, enforces strict payload and commit constraints, and supports extensibility through modular components. Key features include automated data collection, model-based evaluation, robust validation, and a focus on secure, scalable forecasting challenges.","tags":["prediction","bittensor","ai","security"],"twitter":null},{"netuid":124,"subnet_name":"Swarm","github_repo":"https://github.com/swarm-subnet/swarm","subnet_contact":"admin@swarm124.com","subnet_url":"www.swarm124.com","logo_url":"https://raw.githubusercontent.com/swarm-subnet/swarm/refs/heads/main/swarm/assets/Swarm.png","discord":"","description":null,"additional":null,"summary":"Swarm is a Bittensor subnet designed to enable decentralized, autonomous drone flight by leveraging open-source reinforcement learning (RL) policies. Validators generate synthetic map tasks and evaluate miner-submitted RL models in secure Docker containers using PyBullet physics simulation. Miners compete by providing pre-trained RL agents capable of navigating micro-drones through procedurally generated environments, with rewards based on successful and efficient task completion. The project aims to make advanced drone control algorithms accessible, safe, and accountable, positioning Swarm miners as a leading solution for micro-drone navigation in research and industry.","tags":["ai-agent","drone","bittensor","autonomy"],"twitter":"@swarmsubnet"},{"netuid":125,"subnet_name":"8 Ball","github_repo":"","subnet_contact":"","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":null,"tags":null,"twitter":null},{"netuid":126,"subnet_name":"Tiger Beta","github_repo":"","subnet_contact":"","subnet_url":"","logo_url":"","discord":"","description":null,"additional":null,"summary":"Tiger Royalties and Investments PLC is an investment company focused on driving growth by investing in transformative technologies, particularly within the utility meme coin and natural resources sectors. The company leverages world-class expertise to identify and support opportunities in the evolving cryptocurrency landscape, with a specific emphasis on utility meme coins that blend cultural appeal with practical use cases. Tiger is also active in the AI and blockchain space, as evidenced by its involvement in Bittensor subnets and AI agent accelerator programs. The company regularly updates stakeholders on its investments, strategic partnerships, and operational milestones.","tags":["investment","utility-meme-coin","ai-agent","blockchain"],"twitter":"@tigerinvests"},{"netuid":127,"subnet_name":"Astrid","github_repo":"","subnet_contact":"","subnet_url":"https://www.astrid.global/","logo_url":"https://cdn.sigmaarena.ai/ai-logo.png","discord":"","description":"The capital axis for Bittensor.","additional":null,"summary":"Astrid Intelligence PLC operates at the intersection of AI and digital assets, providing an AI-powered platform that autonomously builds and scales digital communities. Their core product, Astrid, leverages AI assistants for automated content creation and community growth, facilitating value exchange and shared intelligence among members. Alongside this, Astrid manages a digital asset treasury, strategically allocating assets to support operational stability and exposure. The company emphasizes rigorous, collaborative, and curiosity-driven approaches, serving clients in biotech, AI, and scientific research with solutions that streamline workflows, accelerate discovery, and enable confident decision-making.","tags":["ai-agent","community","digital-asset"],"twitter":null},{"netuid":128,"subnet_name":"ByteLeap","github_repo":"https://github.com/byteleapai/byteleap-Miner","subnet_contact":"byteleap.ai@gmail.com","subnet_url":"ByteLeap.ai","logo_url":"https://avatars.githubusercontent.com/u/217718200","discord":"https://discord.com/channels/799672011265015819/1387438124132733110","description":"Pioneering the Future of Cloud & Blockchain","additional":null,"summary":"Byteleap is a distributed compute resource platform that connects GPU providers with the Bittensor network (specifically subnet 128), enabling miners to aggregate and lease out compute resources for rewards. The system operates in a three-tier architecture with validators for coordination and scoring, miners for resource aggregation and network interfacing, and workers for hardware monitoring and compute task execution. Rewards are based on active compute leases and computational challenge performance, with a strong emphasis on availability and consistent participation. Byteleap supports integration with a VM gateway for virtual machine orchestration and requires high-performance, bare-metal hardware for deployment.","tags":["compute","bittensor","gpu","decentralized"],"twitter":null}]}